[
  {
    "post_id": "19495-3",
    "author": "free2ride19",
    "content": "\"Exciting updates! Looking forward to Allo v2.1’s release in the next 1-2 weeks. The redesign of the Gitcoin Grants Stack indexer (Indexer V2) sounds promising, addressing scalability and flexibility issues. Key takeaways: Allo v2.1: 1-2 weeks Indexer V2: Q1 2025 (MVP by end of 2024) Modular architecture for improved flexibility and scalability Appreciate the transparency and community involvement. Keep us posted on progress! Questions: Will Indexer V2 support additional chain integrations? How will the new design impact existing grant data? Eager to provide feedback and collaborate.\" @free2ride19",
    "timestamp": "Sat, 12 Oct 2024 05:56:36 +0000",
    "url": "https://gov.gitcoin.co/t/wonderland-x-gitcoin-update/19495/3",
    "is_root_post": false,
    "topic_title": "Wonderland x Gitcoin - Update",
    "topic_url": "https://gov.gitcoin.co/t/wonderland-x-gitcoin-update/19495"
  },
  {
    "post_id": "15991-7",
    "author": "umarkhaneth",
    "content": "Hey Joel! This was a really interesting read. Contrasting the snapshot vote and grants rounds really shows just how different these outcomes were and I wonder why that is. It’s possible they just appealed to two different audiences. For example the DeSci community did not participate much in snapshot but this analysis shows they took a larger share of the donations than one would expect based on the size of the matching pool. It’s possible they’re less involved/engaged in Gitcoin governance but care more about the grantees in the round. This really points to me that if we were to use a snapshot vote to pick core rounds again we’d have to do so differently and maybe we should take QF as governance more seriously. If there’s strong community support for a featured round based on donations in the round then perhaps it should be a core round. I really like how you’re contrasting different QF mechanisms to try and find which one delivers better results. It would be really interesting to see how the results vary by mechanism when zooming in on one round and asking if those results align with what we expect. For example, in the recent Citizens Round, the results were surprising. This was primarily a round for the Gitcoin community and in the initial proposal I called out examples of who I hoped this round would fund: Yet, my favorite grants and the favorites of many high-context Gitcoin contributors did not earn much of the matching pool. In the end, the top four projects in the round were all organizations rather than Citizens. We also found significant evidence that the round was attacked by a small army of airdrop farming robots. I’m wondering how different these results would be if we used a different mechanism. Instead of linear QF, how would pairwise matching, cluster matching, or connection-oriented cluster matching perform? Would the results be more in line with what we’re expecting and resistant to possible sybil/bot attacks?",
    "timestamp": "Wed, 16 Aug 2023 17:09:18 +0000",
    "url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991/7",
    "is_root_post": false,
    "topic_title": "Q.E.D. Program Update Two: Experiments on the vote to choose beta \"core rounds\"",
    "topic_url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991"
  },
  {
    "post_id": "15991-6",
    "author": "borisdyakov",
    "content": "Just wanted to echo what @ale.k and @koday said here – super interesting stuff – and worth exploring a lot more if we ever decide to do another community vote to decide on core rounds it would be awesome to be able to use that data to test different ideas/models/hypotheses/etc For the beta round selection, I know the DeSci community was eager to vote, but GR15 donors/DeSci supporters who didn’t participate in the Alpha round probably weren’t eligible as their passports would have been expired. Multi-round checkout in GS/Allo V2 would also provide a lot of interesting data. Due to high gas fees on Ethereum Mainnet during the Beta Round I think a lot of folks avoided supporting multiple rounds… but once this obstacle is gone we will probably have much richer data on cross-round support. Hopefully multi-round also means simultaneous multi-chain checkout too…",
    "timestamp": "Wed, 09 Aug 2023 19:05:19 +0000",
    "url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991/6",
    "is_root_post": false,
    "topic_title": "Q.E.D. Program Update Two: Experiments on the vote to choose beta \"core rounds\"",
    "topic_url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991"
  },
  {
    "post_id": "15991-5",
    "author": "koday",
    "content": "Thanks for sharing this analysis, it’s super interesting to look at and digest! My one thought - this seems like a great data set to use but I’m curious how each of the 4 methods you outlined would look if we completely excluded ZK Tech votes. On the surface this behavior seemed like airdrop farming or collusion that skewed the votes for that category, especially when you compare it to a) the number of grantees in that round and b) the number of donors/donations. There also were issues with this vote &amp; Passport that meant quite a few people could not participate in time - myself included. I’m curious how many people tried to vote and couldn’t, considering I tried multiple times over a span of a few days and was unable to. This is to say I think these results should be explored more, but I also think we could produce a much “better” data set to experiment on with these methods.",
    "timestamp": "Fri, 04 Aug 2023 14:51:47 +0000",
    "url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991/5",
    "is_root_post": false,
    "topic_title": "Q.E.D. Program Update Two: Experiments on the vote to choose beta \"core rounds\"",
    "topic_url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991"
  },
  {
    "post_id": "15991-4",
    "author": "ale.k",
    "content": "Loving to see the early side-by-sides - Just a thought, but I wonder if there might be some interesting reveals if you segment the data further beyond round? For example, those voters who voted in more than 1 round; those voters who had an on-chain history exceeding 1 year or high average monthly transactions on mainnet - just some low hanging fruit on signals that might show some greater detail in behaviors of these groups. Awesome work - looking forward to more learnings!",
    "timestamp": "Thu, 03 Aug 2023 15:48:12 +0000",
    "url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991/4",
    "is_root_post": false,
    "topic_title": "Q.E.D. Program Update Two: Experiments on the vote to choose beta \"core rounds\"",
    "topic_url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991"
  },
  {
    "post_id": "15991-1",
    "author": "Joel_m",
    "content": "Thanks for pointing out the chopped word! That should be fixed now. As to your two questions: 1. This is a great point. Naively clustering by donation profile is only really possible if you don’t tell people you’re going to do it before hand (or if you’re not too worried about people strategizing). Otherwise, as you point out, it’s easy for a colluding group to create a slate of slightly different donation profiles, which will let them all seem different to the system. But, if we decide that using donation profiles is an important avenue to explore, we can experiment with ways of making it more robust to the type of behavior you describe. 2. I think the answer is probably yes for (2), but someone wouldn’t differentiate themself too much by only giving $1 to a different project. But it gets complicated, because the more money someone gives to another project, the more that other project’s matching amount will grow, which will then eat into the matching amount for the project that they actually like. For (4), the answer is definitely no because that algorithm uses alpha round donation behavior to do clustering, not snapshot vote behavior. In general, we’re really interested in seeing what these clusting algorithms – (3) and (4) – do when you have them cluster on stamps instead of voting/donation behavior, and using alpha donation behavior was supposed to be a sort of stand-in for stamps (because you could imagine someone claiming a stamp certifying that they were, say, a big supporter of OSS projects, etc).",
    "timestamp": "Fri, 28 Jul 2023 03:57:08 +0000",
    "url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991/1",
    "is_root_post": true,
    "topic_title": "Q.E.D. Program Update Two: Experiments on the vote to choose beta \"core rounds\"",
    "topic_url": "https://gov.gitcoin.co/t/q-e-d-program-update-two-experiments-on-the-vote-to-choose-beta-core-rounds/15991"
  },
  {
    "post_id": "16201-7",
    "author": "<p>I’ve not seen the prioritized list of customer pain points nor the thinking about self-serve adoption (though I have dogfooded the product and <a href=\"https://gov.gitcoin.co/t/s19-proposal-amended-grants-stack/16188#h-8-self-serve-qf-rounds-5\">my dogfooding accounts</a> for half of the self serve adoption so far), you are closer to the data/customer/GS team these days, and my advocating for this feature has always been consider feedback, so while I’m disappointed to see the feature deprioritized because it feels like an easy/obvious win to me, I trust your judgement to prioritize Grants Stack work as you see fit.</p>",
    "content": "I’ve not seen the prioritized list of customer pain points nor the thinking about self-serve adoption (though I have dogfooded the product and my dogfooding accounts for half of the self serve adoption so far), you are closer to the data/customer/GS team these days, and my advocating for this feature has always been consider feedback, so while I’m disappointed to see the feature deprioritized because it feels like an easy/obvious win to me, I trust your judgement to prioritize Grants Stack work as you see fit.",
    "timestamp": "Wed, 09 Aug 2023 15:35:54 +0000",
    "url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201/7",
    "is_root_post": false,
    "topic_title": "Org-Wide Roundup, August 8 2023",
    "topic_url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201"
  },
  {
    "post_id": "16201-6",
    "author": "owocki",
    "content": "Thanks for the context. I agree multi-round checkout will probably increase conversion rates. I hypothesize that multi-round checkout AND match estimates (if/when they are built) will have the highest conversion rate. But we will let the data decide. Whats the old trope? “If we have data, let’s look at data. If all we have are opinions, let’s go with mine.” Good to know about the experience with the collections PR, I was not aware that was where it fell over. I know there are some active convos between us about how to evolve collaborations between GS &lt;&gt; outside contributors like Supermodular. The latest thinking is building some easy/lightweight tooling to auto-generate web interfaces for different Allo v2 strategies. This would be an investment in making it easy to not only write new strategies but also to put them in front of users. what we’re loosely calling Grants Stack Frontier (an experimental fork of Grants Stack by Raid Guild, which can build experimental features at its own leisure but could also be PR’d back to Grants Stack proper according to criteria we negotiate later, and only IFF the experimental feature is important enough to warrant the effort). For those who are curious, the first GS Frontier fork is going to be this: We are going to be building a UI that displays a Grants HyperCerts into Grants Stack (running an experiment to see if showing users which Hypercerts are attributed to a Grant changes the contribution behaviour, which could be important in RPGF rounds where the explicit objective is to reward impact retroactively).",
    "timestamp": "Wed, 09 Aug 2023 15:24:43 +0000",
    "url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201/6",
    "is_root_post": false,
    "topic_title": "Org-Wide Roundup, August 8 2023",
    "topic_url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201"
  },
  {
    "post_id": "16201-5",
    "author": "meglister",
    "content": "Also, FWIW… I expect multi-round checkout to have a MUCH higher impact on checkout conversion rates than matching estimates would! We saw checkout conversion rates of 4% in the beta round and 20% in the citizens round where only one round was running – thus checkout fragmentation not an issue. We are aiming for 10% in GG18 (20% likely unsustainable with a larger, more diffuse audience) which would be a 125% increase over beta round.",
    "timestamp": "Wed, 09 Aug 2023 13:38:26 +0000",
    "url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201/5",
    "is_root_post": false,
    "topic_title": "Org-Wide Roundup, August 8 2023",
    "topic_url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201"
  },
  {
    "post_id": "16201-4",
    "author": "meglister",
    "content": "Hey @owocki thanks for the question. We had originally prioritized matching estimates for GG18 as we responded to top pieces of user feedback from the beta round. It was the 3rd-ranked piece of user feedback so third in the sequence of what we built for the round (1: gas fees → PGN support, 2: checkout fragmentation → multiround checkout.) Unfortunately, our work on PGN support and multiround checkout has run over the estimated time to complete, so we don’t have the capacity to also build matching estimates before GG18 donations kick off next week. NB: Why did our estimates run over? 1: We’ve significantly changed team capacity over the last 6 weeks through parental leave/RIF/performance-related layoff, 2: multi-round checkout and PGN both required substantial coordination with other teams 3: multi-round checkout is a massive project that we likely underscoped – retro forthcoming We’ve dropped it from the roadmap entirely instead of delivering after GG18 because we want to focus on delivering features that help us hit our self-serve QF + direct grants goals. We’ve already knocked Gitcoin Grants Round QF goals out of the park! ( Link to budget post for updates on those goals .) Matching estimates are not applicable to direct grants, and feedback so far around self-serve adoption indicates our feature efforts would be better focused on the Grants Manager experience vs the donor experience. Re: could supermodular or another 3rd party build this. We’ve tried two projects with external teams building on the Grants Stack front end (Supermodular- collections, Bootnode- direct grants) and didn’t find that either of them were effective. The Supermodular project was a great 0 → almost 1 but wasn’t able to incorporate styling and UX improvements and never shipped. The Bootnode project required really heavy coordination with our internal teams and the amount of adaptations and merge conflicts from that project were very substantial. Hope this helps, always happy to discuss further!",
    "timestamp": "Wed, 09 Aug 2023 12:39:48 +0000",
    "url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201/4",
    "is_root_post": false,
    "topic_title": "Org-Wide Roundup, August 8 2023",
    "topic_url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201"
  },
  {
    "post_id": "16201-3",
    "author": "quaylawn",
    "content": "Thanks for flagging this! @meglister looping you in here **Edit: I checked out Discord for a rationale behind the deprioritization and it looks like there are significant integrations happening – it would be best if we could keep a lid on some of this for PR purposes",
    "timestamp": "Wed, 09 Aug 2023 11:08:19 +0000",
    "url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201/3",
    "is_root_post": false,
    "topic_title": "Org-Wide Roundup, August 8 2023",
    "topic_url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201"
  },
  {
    "post_id": "16201-2",
    "author": "owocki",
    "content": "I’d love to learn why \"see estimated matching at checkout time \" was deprioritized on the Grants Stack team and if a community vendor (like supermodular) could build it instead. IIRC in Gitcoin Grants round 3 , we saw a 50% - 70% conversion rate increase on crowdfund contributions simply by showing the user that their $1 could have $10, $100, or even $1000 worth of impact (as we know, the number depends on the number of contributors) without them having to do the math. This is how the UI has looked in the past: Of course, just because the old centralized platform saw this conversion rate increase from having the matching estimates in the UI, doesnt guarantee that Grants Stack will. But it seems like a worthy thing to try from my perspective as an outsider. My 002 wei.",
    "timestamp": "Tue, 08 Aug 2023 19:59:48 +0000",
    "url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201/2",
    "is_root_post": false,
    "topic_title": "Org-Wide Roundup, August 8 2023",
    "topic_url": "https://gov.gitcoin.co/t/org-wide-roundup-august-8-2023/16201"
  },
  {
    "post_id": "16142-1",
    "author": "gaoa97",
    "content": "Hot Topics: @owocki introduces grants-ETL, a user-friendly tool built by Supermodular that provides an accessible and well-documented relational database to streamline the data analysis process for Grants Stack, Allo, and Passport , eliminating the need for extensive custom Extract Transform Load (ETL) pipelines. @owocki created a $10k QF round on QuadraticLenster.xyz for posts using the #ethcc hashtag. Future plans include integrating QF into every Lens app, potentially leading to substantial campaign contributions. Read the full post to discover how to create custom-sized rounds for any #hashtag . Learn about the Gitcoin Community Proposals (GCP) process , where community members propose changes to Gitcoin’s ecosystem, fostering engagement and shared governance. Find out how GCP funding priorities are changing by reading the most recent GCP update from @Viriya , which focuses on projects with obvious ROI and alignment with product roadmaps. Curious to understand how past voting/ funding outcomes change when using plural QF algorithms? Check out the second Q.E.D. Program Update , where @Joel_m delves into the analysis of snapshot quadratic votes for core rounds and community-led rounds, evaluating the effectiveness of the voting algorithm in predicting popular rounds. Weekly Workstream Update Here are key highlights from the weekly workstream update - (video here ) Allo Allo V2 Deployment: Allo V2 has taken a significant step forward with successful deployment on testnets. A comprehensive Allo V2 introduction post has been published on the Gitcoin blog, accompanied by an informative Twitter thread . Development Progress: The development team is diligently achieving milestones such as completing the MVP end-to-end flow and finalizing the strategy library. Rigorous testing is underway, ensuring a seamless experience for users (100% coverage on Registry and Allo). Collaborations &amp; Partnerships: @nategosselin and @0xZakk are actively fostering Allo’s growth. Productive discussions with a resident and collaborations with the Celo team are in progress. The Sablier team has submitted two innovative strategies for a hackathon program, and upcoming meetings with QuestBook and Superfluid are set to further enhance Allo’s ecosystem. Funding the Commons Hackathon &amp; Residency: Allo is deeply engaged in the upcoming Funding the Commons Hackathon and Developer Residency. These initiatives serve as catalysts for growth, fostering interactions, and innovation. Milestone Timeline: A well-defined timeline has been set, aligning with the vision for Allo’s evolution. The current focus is on documenting and preparing for Audit next week. Other milestones include: Community Build Period (Now - Sep 8 ), audit (Sep 11-15), audit remediation (Sep 18-29) and the mainnet launch is targeted for Oct 2. Organic Community Building: Recognizing the enthusiasm and interest from the community, Allo has embraced a gradual approach in line with the upcoming phase. The team is proactively engaging with the community, rolling out content, and encouraging organic growth. Twitter following is steadily expanding (reaching 4K followers), thanks to the efforts of @alexalombardo @garysheng and @MathildaDV in amplifying Allo’s presence. Check out the Allo Brand Design Elements with updated slides, animations, illustrations, and banners. Refined graphics, the brand book and forum post are in progress. V1 of Brand Book is complete! Grants Stack PGN Support: This week, the Grants Stack team shipped support for Public Goods Network (PGN) Mainnet and testnet on all Grants Stack apps. Now, you can create a project, apply to a round, create programs and rounds, and donate to rounds all on PGN. You can learn more about PGN here . Multi-Round Checkout (MRC) Progress: Significant strides have been made in the development of MRC. Contract changes have been integrated, and UI creation is in progress. This week, end-to-end testing is scheduled to ensure a seamless experience. Matching Estimates: While the focus is on MRC, work on matching estimates is briefly paused. Plans are in place to resume this effort as soon as MRC development is complete. Discovery Session: Fill out this form to be put in touch with our support squad! Once you’ve submitted, someone will be in touch within 24-48 hours to answer any questions you may have about Gitcoin Grants Stack. Marketing and Strategy: The announcement of PGN support garnered a positive response. The team is actively refining the go-to-market and funnel strategies. The newly launched Discovery Session form has already generated around 10 new leads. Support Ticket Insights (July 17-23): 265 new tickets via live chat and 61 new tickets via email. The support team has been handling a notable influx of requests, with a significant portion related to Twitter stamps. Use support@gitcoin.co or intercom for filing issues. Grants Stack Release Notes are now available. The Manager Toolkit is being updated as a more robust guide and inspiration for running a Quadratic Funding grants program. Public Goods Funding GG18 Round Applications Live: Applications for the Core Rounds are now open, marking an exciting start to new collaborations. GG19 Season Planning: Expected to run in November. Collaborations secured with the American Cancer Society ($60k matching pool) and potential UNICEF engagement. The Season 19 Amended Budget is nearly finalized, bringing forth updated goals and objectives. Octant win: A significant $480,000 win for the DAO, evenly split between the treasury and the matching pool, through a collaborative initiative with Octant ’s parent company, Golem Foundation . This accomplishment highlights a resilient growth trajectory despite market conditions, and it opens the door for potential future funding. GS Test Round on PGN: The PGN meme contest has concluded successfully, Initial feedback on interactions involving PGN, such as seamless wallet integration and streamlined grant donations, has been positive. The contest’s success underscores the community’s enthusiasm and sets a precedent for more engaging initiatives in the future. Check out the progress tracking notion page and the PGF Calendar to stay up-to-date on the objectives outlined in the proposal for seasons 18 and 19. Passport Galxe Campaign Impact: The recent #AntiSybilAssembly initiative to incentivize the creation of passport-gated Galxe campaigns has generated significant interest, with over half a million impressions and 85k+ participants within 24 hours. This has led to scaling challenges and support queries from existing passport holders. Efforts are underway to optimize the system’s performance during surges. Onchain Passport Progress: The highly anticipated onchain passport is set to launch on August 15th on Optimism L2, there’s planning for an onchain stamps campaign underway. This advancement promises enhanced security and accessibility. Streamlining Support: A new Passport Banner will be created to provide real-time updates on known issues, aiding support teams and reducing user inquiries. Enhancing Integrator Experience: Integrator funnel improvements are being explored to foster smoother interactions for those joining the Passport ecosystem. Integrations: Plans are still in motion with Supermodular to integrate Passport with Snapshot, and 75% through scope for Discourse plugin with CommunityHQ. Information Architecture: A comprehensive set of resources with automated docs and tools is being curated to empower both users and integrators, synchronizing all developer documents by migrating from gitbook to Nextra. Updates include a dedicated page for Platform Integrators, an evolving style guide, and integration of new parameters. Brand Revisit: The Passport brand is undergoing a final-stage revisit, ensuring alignment with the mission and vision while presenting a compelling identity. Stamp Integrations: The stamp selection is dynamically evolving, integrating a twitter revamp, Phi, Guild, Holonym, Idena, Civic, &amp; Hypercert, all with new scores and scoring weights. Future Outlook: Humanode &amp; CyberConnect stamps, Discourse plugin development, Snapshot integration, and ComposeDB upgrades are among the prospects on the horizon, set to further elevate the Passport experience. Passport Release Notes are now available. Supermodular team has built a Passport-gated faucet starter that can be forked and run on any network. Prebuilt Passport components are under planning. MMM Website Revamp : We’re nearing completion of the website overhaul. The program page is in focus this week, with work beginning on the password page. Excitingly, a new brand book for Passport is underway, bringing fresh visuals and refined messaging to the platform that reflects the collective efforts of Alexa, Laura, Gary, Jeremy, and the entire team. GG18 Applications: The grants.gitcoin.co page has been revamped for the third time in three months, showcasing our commitment to delivering an optimal user experience. Stay tuned for upcoming blog posts with insights into the visuals and their inspiration. Visuals and Canva Kit: New visuals are in development, aiming to represent our vibrant ecosystem and decentralized (mycelium) networks. A Canva Kit is also in the works, making it effortless for grantees to create engaging visuals and animations to promote rounds and engage their communities. Brand Book Updates: We’re crafting internal pitch decks for both the PGF team and the broader DAO. A comprehensive brand book rollout is underway: Passport (w/o July 31), * Allo (w/o Aug 7), Grants Stack (w/o Aug 14). GitcoinDAO Governance Overview: Snapshot polls GTC Stewards. Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally. Active Proposals: [GCP-014] Gitcoin handshake MetaFest [Discussion &amp; Feedback Request] GG18 Round Eligibility Update Gitcoin Community Proposals (GCPs) Upcoming events Gitcoin Community Call: Weekly discussions to seek community opinions on the latest DAO decisions happen every Wednesday @ 12 pm ET. Catch up on recordings of recent conversations here: Aug 02: Global Impact of Gitcoin Grants July 26: Gitcoin Community Call July 12: Measuring impact in Grant Funding New to Gitcoin? Explore the future of Gitcoin at our new website , and check out Gitcoin Community Hub for key resources and events. Thanks for reading! PS: Click here to subscribe to the DAO Digest",
    "timestamp": "Thu, 03 Aug 2023 13:55:08 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-15-2023/16142/1",
    "is_root_post": true,
    "topic_title": "Gitcoin Digest #15 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-15-2023/16142"
  },
  {
    "post_id": "10522-3",
    "author": "aliziya4",
    "content": "very good text. hi thanks for text",
    "timestamp": "Wed, 02 Aug 2023 09:49:23 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522/3",
    "is_root_post": false,
    "topic_title": "GitcoinDAO Digest #16 2022",
    "topic_url": "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
  },
  {
    "post_id": "10522-2",
    "author": "jonas",
    "content": "allways a good read. well done @umarkhaneth @Fred",
    "timestamp": "Fri, 06 May 2022 17:53:56 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522/2",
    "is_root_post": false,
    "topic_title": "GitcoinDAO Digest #16 2022",
    "topic_url": "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
  },
  {
    "post_id": "10522-1",
    "author": "umarkhaneth",
    "content": "Season 14 Budget Discussions are in full swing! Make your voice heard If you would like to receive this newsletter in your inbox, sign up here! Key actions for this week: Please provide your feedback on the workstream budget proposals . Discussion has been extended to May 10th with Snapshot proposals going live on May 11th. GitcoinDAO’s anniversary is right around the corner! We’re requesting your input on what to include in our year-in-review! If you’ve been a workstream contributor we would also appreciate if you could fill out this quick survey Hot Topics: The GitcoinDAO Governance Process V3 is the source of truth for details on how the DAO is governed. It outlines the roles and responsibilities of contributors, delegates, and stewards. It describes the processes used to move proposals through different stages so they can be agreed on and executed. This includes how new and existing workstreams can be funded. The process also includes details about the role of the CSDO (Cross Stream DAO Ops) as a coordination layer among workstreams to discuss, review, and ratify DAO-wide initiatives. Joe shares a Data Analysis for Season 14 Budget Proposals which compares season 14 to 13 in terms of each workstream’s budget and requested amount. The data analysis highlights that PGF, MMM, and DAO Ops workstreams are asking for more funding than season 13 while FDD, MC, and dCompass are asking for less. Owocki shares a S14 Voter Guide Template to encourage intersubjective consensus through stewards clearly articulating what they are voting for and why. Vivek amends the S14 KERNEL Budget Request by lowering the funding request from $900k to $576k USD (a 36% reduction). This change is following specific feedback from @ceresstation and Linda . The Season 14 Budget Request for dCompass by Huxwell features questions from QZ about how the funds from last quarter can carry over to cover most of the requested budget. The workstream only needs an additional 3.5k GTC to meet its S14 budget request. The budget request for decentralizing Gitcoin Kudos has questions from Simona and Joe about the background of the proposed team and the need for soulbound NFTs. @ceresstation agrees with Joe about wanting to know how this fits into Gitcoin’s product roadmap for Grants 2.0. The overton window for Grants 2.0 by Owocki discusses how there is a window of time for Grants 2.0 to come into existence and that window is closing. We have a lot of (friendly) competition for market share that has more velocity than us yet we have way more resources than our competition. Owocki requests proposals for ImpactDAO Category Creation and Impact Certificates . Creating ImpactDAO as a category means amplifying understanding of what an ImpactDAO is and helping ImpactDAOs be successful. Impact Certificates create legitimacy around who has created impact for social good and “could get really powerful if we were able to create buy pressure for Impact Certificates” Owocki shares his Practical Pluralism Essay Draft and requests feedback. Pluralism is the understanding that diversity within a given context generally results in better outcomes. For the Ethereum ecosystem to be antifragile, we need technological diversity of clients, RPC nodes, funding mechanisms and cultural diversity of people, communities, opinions. 8 Ideas for DAO Work @ Maximum Coordination ™ by Owocki explores how we can improve workstream budgeting, structure, and coordination. Three of the eight featured ideas (thinner workstreams, subDAOs, Orca pods) focus on creating smaller groups to allocate funding to. Another three of the eight (conviction voting, Coordinape, higher fidelity voting) focus on creating more granular governance processes for how to determine where funds should flow. GitcoinDAO Governance Overview: Proposal Discussions Active Proposals Latest completed proposals PGF - Season 14 budget request For $1.19mm USD / 198k GTC DAO Operations S14 Budget Request For $989k USD / 179k GTC MMM - Season 14 budget request For $841k USD / 152.9k GTC KERNEL: A GTC Workstream Proposal For $576k USD / 96k GTC Moonshot Collective Season 14 Budget Request For $564k USD / 103k GTC FDD Season 14 Budget Request For $486k USD / 89k GTC Decentralize Gitcoin Kudos For $200k USD / 33.4k GTC dCompass - Season 14 budget request For $114k USD / 19k GTC GR14 Round Structure &amp; Future of the Main Round Workstream Discussion Public Goods Funding In our season 14 budget request , Linda and Simona ask for details around why the budget amount for the Public Library is as high as $90k USD for one season. QZ explains this is the same amount as last season and the library is also the primary source for onboarding new contributors. Kyle suggests a 45% budget reduction from 160k GTC to 88.75k GTC @ceresstation responds that it’s bad principle to restrict the budget because it went unspent, the DAO workstream is gaining employees from holdings, the safe could be updated, and they are already taking the bear market into mind. Moonshot Collective In the collective’s season 14 budget request , Kyle shares his sentiment that the budget should be reduced by 19.2% from 103.7K GTC to 83.8K. QEDK points out that Moonshot’s mission is to be more than a prototyping workstream, it is to further public goods in the Ethereum ecosystem as a whole (such as by having contributors who are involved with regen projects like the Citizen House and Token Collective). Joe recommends focusing on finding solutions for problems faced by other workstreams at GitcoinDAO. Do not miss this very special episode of the Green Pill Podcast hosted by Kevin Owocki ! In this episode , Kevin is joined by Phoebe Tikkel (aka Solarpunk Girl) who is the founder of Moral Imaginations , an organization using collective imagination tooling to make a more harmonious world. Fraud Detection &amp; Defense (FDD) FDD’s season 14 budget request includes comments where several community members express their gratitude and excitement for FDD while looking forward to greater inter-squad cohesion. QZ asks for additional focus on Grants Policy communication, removal of FDD storytelling, and more inter-WS discussions. Joe responds that much of this highlights the need for increased communication, which storytellers can do. Kyle suggests a 43% budget reduction from 118K GTC to 67K and says “Gitcoin seems to be paying for the education and advancement of a number of ideas - Sybil DAO, Most of ‘Evolution’, Catalyst, etc. without any discernible increase in value being delivered back to the DAO.” Joe points out FDD’s role in solving problems which existentially affect Gitcoin’s future, that quadratic funding does not work without sybil resistance, and FDD’s focus on creating a decentralized protocol. Mandates delivery report (open for feedback) by kishoraditya explores how to create metrics for processes within DAOs. These metrics focus on evaluating FDD core teams and/or functions such as Grants Investigation Agency, Sybil, and Project Management. The metrics were drafted through creating feedback loops with relevant SMEs to ensure high trust in the system. The Rewards Modeling squad’s OKR Report provides a solution for the community to not only own the Grants 2.0 infrastructure but also the structures which allow communities to meaningfully access it. According to Disruption Joe , we should “not only build the resource allocation infrastructure of the future with Grants 2.0 , but ensure there are onramps for all voices to be heard.” This system would allow for anyone to participate in moderating for grant eligibility, sybil users, and any other subjective decisions the community needs to make. If we don’t want content moderation to be censored by a large company or single point of failure, we need to decentralize the inputs to the system. Merch, Memes &amp; Marketing The MMM season 14 budget proposal has questions from Simona regarding if PR/Comms from YAP Global are needed. Kyle shares his sentiment that MMM should reduce budget by 21% from 167.7K to 132.5K GTC in order to cut out “nice-to-haves”. Joe supports the current budget but points out a lack of clear, measurable metrics. Sean updates the budget proposal to reduce the funding request by 9% from $923k to $841k USD by eliminating virtual events funding and decreasing the funding request for Content, Brand, and Ops substreams. Memepalooza 8 is happening this Friday from 6 to 8 PM UTC. We’ll be memeing on all things web3 &amp; public goods in our discord with our friends from Prime DAO and CultDAO . You won’t wanna miss this ! DAO Operations Kyle proposes a 4% budget reduction from 115K to 110K GTC in our season 14 budget . Joe asks for outcome definitions which focus on connection to problems faced by DAO Ops customers (other workstreams) and more clearly defined success metrics. Jodi responds with a proposal to remove specific-to-accounting reserves and reduce professional development budget by 50% to lower the overall workstream budget by 5.4k GTC. She goes on to discuss how the workstream arrived at our OKRs, how we prioritize work, and how we attach accountability to people. On our weekly CSDO call we decided to extend the time workstreams have before their budgets go to Snapshot, create an extra steward council call for budget discussion, and test a new Gitcoin Conflict Resolution Policy within the DAO Ops workstream. In Treasury Diversification Working Group Updates , Kyle discusses the potential for a bear market and Gitcoin’s role as the light that fuels the ecosystem. Because of that, Gitcoin needs to “really focus on the core thesis that we are a protocol DAO with great impact (funding for public goods).” The post takes the stance that Gitcoin budgets have grown faster than protocol development and we should consider new ways for us to continue to fund ourselves. We are hiring! We are still looking for a qualified Support Lead. We also just put up a new role for someone to join us as a Community Management Lead! Upcoming community events Come make memes with us and our frens from Prime DAO and CultDAO ! Memepalooza 8 is happening this Friday from 6 to 8 PM UTC in our discord! Drop in on our weekly DAO Vibes &amp; Office Hours w. Kevin Owocki on Wednesdays at 12PM ET on Discord ! We have been seeing great attendance and engagement and we would love for you to join us. Afterwards there is the Gitcoin Contributors Happy-Hour starting at 13.30PM ET. Community Onboarding Call! New to Gitcoin? The next event will be Monday, May 9th from 1:00 to 2:00 PM EST. We’ll tell you all about how we’re organized and how you can become an active contributor. If you haven’t applied, do this first! New to GitcoinDAO? TLDR - What is Gitcoin? Apply to become a member of GitcoinDAO by filling out the application form. To learn more about what the DAO onboarding experience entails, please visit our Notion page . Have you already applied but have yet to join a Gitcoin workstream? Start here to learn more about where you might fit in. Thanks for reading! As always; GitcoinDAO Digest is a community-led publication with summaries of the most important discussions and proposals across GitcoinDAO, with relevant links for further reading.",
    "timestamp": "Fri, 06 May 2022 16:33:21 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522/1",
    "is_root_post": true,
    "topic_title": "GitcoinDAO Digest #16 2022",
    "topic_url": "https://gov.gitcoin.co/t/gitcoindao-digest-16-2022/10522"
  },
  {
    "post_id": "16063-1",
    "author": "Kevin Owocki",
    "content": "gm supporters, builders and champions of public goods We’re back with our monthly update for all things Gitcoin: Gitcoin Grants, Grants Stack, Gitcoin Passport and Allo. Mark your calendars for Gitcoin Grants 18! August 15 - 29, 2023. #GG18 applications open on August 1st. Interested in applying? Check out the eligibility criteria for more information and head to grants.gitcoin.co when applications are live. We’ve been busy making improvements to Grants Stack to continue making it easier than ever to manage, discover, donate to and participate in grants programs. New this month: Interested in Grants Stack but want to chat details? Fill out this Grants Stack contact form to be in touch with a member of our team. We’ve been busy improving and adding stamps to Gitcoin Passport , and improving our scoring algorithm to distinguish real humans versus bots and Sybils. New this month: Shipping soon: On-Chain Stamps (more on this soon) Click here to learn how to protect your project with Gitcoin Passport today. Allo Summer is going strong. This past month was big for us: We also made a big splash at EthCC, using Funding the Commons, Schelling Point Sessions and the EthCC conference as an opportunity to preview what’s to come ( details below ). What’s next? Allo v2 is coming. Interested in building on Allo? Fill out this form to join our core devs community! PGN (Public Goods Network) is now live on Mainnet. PGN is the world’s first L2 that works to create durable and recurring funding for public goods! Learn more about PGN here. Paris was a whirlwind, and we’re feeling more energized than ever to build. Below is a roundup from Funding the Commons, EthCC and Schelling Point Sessions: ICYMI, listen to the recording of our Community Call last week that gave a recap on EthCC. Team Gitcoin Want to get these monthly updates in your inbox? Head to gitcoin.co , and select “Get Updates” to sign up! Make sure you tick “keeping up to date with Gitcoin.” Read full topic",
    "timestamp": "Mon, 31 Jul 2023 15:12:05 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-monthly-update-july-23/16063",
    "is_root_post": true,
    "topic_title": "Gitcoin Monthly Update: July '23",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-monthly-update-july-23/16063"
  },
  {
    "post_id": "15972-1",
    "author": "gaoa97",
    "content": "Hot Topics: At EthCC, Supermodular announced the launch of a new integration with Lens Protocol that will bring Quadratic Funding (QF) to web3 social apps. The pilot launch was QuadraticLenster.xyz , a web3 social media app with funding mechanisms embedded in the newsfeed. Get up to speed on how the experiment went and watch the full talk about social media and public goods by @owocki in the QuadraticLenster.xyz Launch Wrap-Up . @koday requests feedback on the GG18 Round Eligibility Criteria , outlining the general policy that all grants must meet to be considered for acceptance into any of the four core rounds. Additionally, grants must meet additional criteria specific to the round they are applying for, which will be provided in the description of each round’s eligibility criteria. @epowell101 presented a revised proposal seeking a commitment of $65,000 from the Gitcoin Treasury to support the OpenData Community (ODC) . The updated version incorporates previous feedback, including a basic ROI analysis with an ongoing metrics website, outlining the strategic value of the OpenData Community to Gitcoin and highlighting the positive impact derived from supporting decentralization at the data layer. Did you join EthCC in Paris? @CoachJonathan provided his in-depth retrospective on EthCC , featuring Funding the Commons and Schelling Point sessions while encouraging other attendees to share their key takeaways and learnings from the event. Join the conversation in the comments section with other valuable retrospectives and feedback. @kyle shared an update on how PGN is related to the race to the bottom premise suggested in his talk at Zuzalu. Check out the full talk to learn more about the thinking behind getting as close as possible to an always-on, legitimate and bountiful source of public goods funding. Weekly Workstream Update Here are key highlights from the weekly workstream update - (video here ) Allo The development is currently in week nine, MVP end-to-end flow and Strategy library are completed, and the main components of the project are in place, with minor adjustments still needed. A library of nine strategies has been completed, making it easier for users to implement custom strategies with low auditing expenses. Protocol testing is a priority this week, aiming for close to 100 tests covering each and every component. Upcoming focus on documentation preparing for the audit next week, including guidelines for both auditors to understand the protocol and for developers to use the protocol effectively. The team had a successful and well-received presence at conferences like EthBarcelona, EthCC, and Schelling Point. Educational talks and workshops were delivered, generating around 50 leads for potential partnerships and integrations, exceeding the results from previous conferences. Grants Stack PGN mainnet was launched on Grant Stack, completing support for both testnet and mainnet. A collaboration with the Supermodular team on a Gitcoin-hosted bridge is in progress. The next priority is to release the multi-round checkout, with significant progress already made on the changes required for Allo V1 and the new contract, allowing users to checkout across different rounds and chains all in one cart. Spike on matching estimate calculations is done. Matching estimates at checkout are in progress. The drip campaign continues, with an upcoming article on identifying high potential grantees. Additionally, refining the channel strategy is underway, with a focus on supporting direct grants in the future. Grants Stack Release Notes are now available. Check out the Allo Brand Design Elements with updated slides, animations, illustrations, and banners. Refined graphics, the brand book and forum post are in progress. V1 of Brand Book is complete! The Manager Toolkit is being updated as a more robust guide and inspiration for running a Quadratic Funding grants program. Support Ticket Stats (July 17-23) increased: 216 new tickets via live chat and 70 new tickets via email, revolving around Passport score, twitter stamp, and fb stamp. Use support@gitcoin.co or intercom for filing issues. Public Goods Funding Check out the progress tracking notion page to stay up-to-date on the objectives outlined in the proposal for seasons 18 and 19. Progress has been made in defining the service offerings, estimating the costs and resources needed for program rounds (Core + Featured). Collaboration with the MMM team and others is ongoing to refine the roles and responsibilities. Upcoming focus will be on further developing the functions of sales and partnerships to drive revenue. The next steps involve managing the expenses and overhead of the workstream to acceptable levels, creating and maintaining an ongoing P&amp;L analysis. GG18 plan is near final, and planning for GG19 has begun, scheduled for November 1st to 15th. Mark your calendars now (and check out the PGF Calendar to stay up to date). The team is making progress in identifying featured rounds for GG18 and GG19. Standard reports and a simple CRM have been developed to track opportunities, and follow-ups from EthCC are underway to explore potential opportunities. Passport Passport Stamp updates include a twitter stamp revamp and six stamps have been integrated: Phi, Guild, Holonym, Idena, Civic, &amp; Hypercert, all with new scores and scoring weights. Ongoing Release support. The launch of onchain passports is tentatively targeted for August 15. ComposeDB Upgrade and Humanode &amp; CyberConnect Stamps are still in progress. Over 2k new followers were gained on Twitter over the last 2 weeks, with over half a million impressions; and high memetic resonance building up about Sybil Defense tools. Gitcoin Passport integration into Guild has been announced, Galxe NFT experiment will be announced this week. Passport Brand revisit is in final stages New Release Notes are available. The Discourse plugin and Snapshot update are under planning. Supermodeular will build Snapshot Update after agreeing to scope and implementation in Paris. Documentation updates include: new page dedicated to Platform Integrators, callouts and links describing the ever-changing stamp and score weight landscape, style guide: onchain, offchain, stamps, passport API, scorer, and new parameters. An Information Architecture update with automated docs and tools, simplified Passport introduction, and Nextra migration are under planning. Supermodular team has built a Passport-gated faucet starter that can be forked and run on any network. Prebuilt Passport components are under planning. MMM Website updates have been deployed on grants.gitcoin.co and WTFisQF.com . Gitcoin Grants asset development is in progress for the upcoming GG18 campaign, including internal Pitch Decks, persona review and documentation, channel audit/revisit, and brand book sprints Gitcoin has been working on repositioning itself as a tech-first organization focused on the funding, building, and protection of digital public goods and protocols. This effort seems to be paying off as the media is starting to use this new narrative to describe Gitcoin , instead of just focusing on hackathons and bounty programs. The recent Gitcoin House hosted at EthCC was a huge success, gathering positive feedback and valuable insights from interviews with various stakeholders and over 200 attendees. Talks by @meglister , @kevin.olsen , and @azeem were well-received, with @0xZakk ‘s talk about Allo being particularly recommended. Sponsors expressed interest in future events and revenue generation opportunities. GitcoinDAO Governance Overview: Snapshot polls GTC Stewards. Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally. Active Proposals: Steward Council Elections v3 announcement [Revised Proposal] -ODC Funding (and token distribution) [Proposal] Gitcoin sponsoring MetaFest Upcoming events Gitcoin Community Call: Weekly discussions to seek community opinions on the latest DAO decisions happen every Wednesday @ 12 pm ET. Catch up on recordings of recent conversations here: July 26: Recap on EthCC, Funding The Commons and Schelling Point July 12: Measuring impact in Grant Funding July 12: Coordination in public goods and season 9 New to Gitcoin? Explore the future of Gitcoin at our new website , and check out Gitcoin Community Hub for key resources and events. Thanks for reading! PS: Click here to subscribe to the DAO Digest",
    "timestamp": "Thu, 27 Jul 2023 14:06:07 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-14-2023/15972/1",
    "is_root_post": true,
    "topic_title": "Gitcoin Digest #14 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-14-2023/15972"
  },
  {
    "post_id": "13852-8",
    "author": "tkgshn",
    "content": "@DisruptionJoe We stopped over $3 million in fraud with unknown amounts deterred how to estimate? if you have any resources to quantify, I’d like to see them. maybe it can show the Price-performance ratio for DeCartography. How Much Does Plural QF Reduce Collusion Compared to Normal QF? 🧙 🧙‍♀️ Ideas and Open Discussion In our efforts to mitigate collusion and make QF more effective, we’ve been exploring the concept of Plural QF. To illustrate this, let’s consider a comparison between Plural QF and Normal QF. The Setup Let’s consider 2 projects with 7 contributors each and a $100 matching pool The Results Under Normal QF, our projects received: Project #1: $140 Project #2: $129 Under Plural QF, our projects received: Project #1: $154 Project #2: $115 Let’s break it down. Normal QF [image] Co… Read full topic https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852/9 Fri, 07 Jul 2023 04:14:49 +0000 gov.gitcoin.co-post-13852-9 FDD Workstream Dissolution Details FDD Workstream Dissolution Details ZER8 As a former member, team lead in FDD, but even more importantly as a person that was genuinely passionate about defending web3, public goods and also Gitcoin grants+ grantees this feels like the end of an era. I remember that last year in a call we were asked to describe what’s happening in the DAO using one word and I chose “transformation”…it seems like the transformations will continue and at some point I’m sure equilibrium in Gitcoin will be reached Everyone that worked in FDD and with Disruption Joe knows the level of leadership skills he posses, the iron nerves he has and the amount of work he put in to the FDD success(which translated into funds safu for the DAO and the grantees). Speaking solely from the results POV I actually believe they could not have been better…stopping over $3 million dollars in fraud, developing algorithms, reviewing a HUGE volume of grants all while constantly coordinating with every WS, grant creator and all the parties involved in the grant program was a huge responsability and I’m certain that @DisruptionJoe was the perfect man for this job. As a bonus the FDD also created the ODC lead by @epowell101 which already has amazing results Honestly I don’t think that this outcome is only FDDs fault, as the DAO dynamics and also products constantly shifted and at times we even saw some competition over coordination. We can also involve some 101 evolutionary biology and see at this particular situation as an evolution, the dominant WS that posses leadership with more tokens delegated survived and absorbed talent from the other WS that did not. FDD strived to be have credible neutral results and also to be credible neutral and that could be seen as a mistake. I would like to thank all the contributors that put in passion/work and strived to protect the Gitcoin rounds while ensuring credible neutral processes for the grants program. Special thanks to DisruptionJoe for all your work and for the mentorship that you provided to everyone in the FDD and also the DAO as a whole . Best wishes to everyone and I hope to see you all in the web3 ecosystem",
    "timestamp": "Tue, 11 Apr 2023 10:42:20 +0000",
    "url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852/8",
    "is_root_post": false,
    "topic_title": "FDD Workstream Dissolution Details",
    "topic_url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852"
  },
  {
    "post_id": "13852-7",
    "author": "epowell101",
    "content": "Just a quick note to say thank you to DisruptionJoe who took a chance on me - and has taught me an enormous amount about everything from Anti-Sybil approaches → to DAO governance techniques → to who is who in the wonderful Zoo that is regen web3. This isn’t the end but just the beginning of the DAO we all love - Gitcoin - becoming more data savvy and of the broader ecosystem as well being able to protect themselves through the use of data &amp; regen rangers. Thank you DisruptionJoe",
    "timestamp": "Sat, 08 Apr 2023 13:49:36 +0000",
    "url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852/7",
    "is_root_post": false,
    "topic_title": "FDD Workstream Dissolution Details",
    "topic_url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852"
  },
  {
    "post_id": "13852-6",
    "author": "jengajojo",
    "content": "Thank you @DisruptionJoe @tigress @omnianalytics @epowell101 and others for your fantastic contributions",
    "timestamp": "Fri, 07 Apr 2023 09:46:56 +0000",
    "url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852/6",
    "is_root_post": false,
    "topic_title": "FDD Workstream Dissolution Details",
    "topic_url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852"
  },
  {
    "post_id": "13852-5",
    "author": "ccerv1",
    "content": "I just wanted to share a brief note of appreciation to @DisruptionJoe plus all the current and former members of FDD for their contributions, their impact, and their graceful transition. I had the privilege of working with this group for one season: FDD was an exceptional collection of regens dedicated to preserving the integrity of quadratic funding and innovating with on-chain data. I’m excited to see what you all do next. Just remember to watch out for Cici!",
    "timestamp": "Fri, 07 Apr 2023 02:56:57 +0000",
    "url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852/5",
    "is_root_post": false,
    "topic_title": "FDD Workstream Dissolution Details",
    "topic_url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852"
  },
  {
    "post_id": "13852-4",
    "author": "lee0007",
    "content": "Phenomenal undertaking, FDD delivered under your leadership @DisruptionJoe and imo the results see you recognised as world-class leaders in Sybil defence at Scale. Onwards &amp; upwards",
    "timestamp": "Fri, 07 Apr 2023 02:54:13 +0000",
    "url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852/4",
    "is_root_post": false,
    "topic_title": "FDD Workstream Dissolution Details",
    "topic_url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852"
  },
  {
    "post_id": "13852-3",
    "author": "DisruptionJoe",
    "content": "We have no intention of taking any future retroactive rewards. It’s a good question though. I believe the current retroactive rewards round is setup to disqualify anyone who was paid by the DAO for their work. We do mention that we are keeping the FDD alive as a MolochDAO. This is because we have $22,500 coming from Aave upon completion of a project. Additionally, there is the possibility of future airdrops which we would hate to go to waste Kritikal_Eye: I am curious if you have anything you’d do differently if you could do it all over again? Do you have any constructive criticism for yourself? Yeah. A ton! Everything is a learning experience and there are few in my life I would do exactly the same. By no means were we perfect, but we did work hard and try to produce results. I think our results and transparency stand on their own. I don’t feel regret as I allow myself grace to understand the difficulty of the position and to accept our successes. This is not to say I didn’t learn immensely from the experience or that we didn’t fail on some attempts. Do I want to go back in a time machine to do it differently - no. Will I take the lessons I’ve learned into my future endeavors - yes. We aren’t leveraging this for future retroactive public goods funding - frpgf Therefore, I’m not sure what you would like to hear, but here it goes: A few things I could have done better: Organize FDD work in Github from day 1 rather than Notion - We could have been more open and had community contributions from the start. We were scared that the attackers would see what we were doing and win. Now I know that with the open data on the protocol, our fraud defense can be “kerckhoff compliant”. Hire better from day 1 - Our original model was to see how decentralized we could be while still hitting objectives. What the DAO saw as wasted spending, I saw as lessons in how to decentralize. The bear came along and this was no longer worth it and we had to run the workstream like a company department to survive. This had positive and negative effects. We were able to hire world class talent, but we also lost some world class passion. Its hard to let go of passionate people willing to work hard, but efficiency requires specialist and expertise. We could have skipped the first part if we knew the DAO wasn’t interested in workstreams being autonomous. Better communication of the need for a review protocol - I feel quite bad that we can’t offer program managers better systems for review and appeal. Decentralized systems are only as strong as their weakest point and until these items are solved, we can’t provide a corruption resistant guarantee. Focus more on personal development - Sybil resistance is a gnarly problem and working on it was very captivating. I spent less time than I should have developing myself and my relationship with leaders around the DAO. Many people reported that they felt FDD worked in a silo. I felt that we rarely got responses from others. I didn’t know how to respond to comments like “I don’t have time to read this detailed report you put together. I feel like you’re ddos the voters” next to “this doesn’t tell me enough” and “I don’t have the skills to understand this so I’m going to vote the way xxx person did”. At a casual glance I can complain about the stewards, but in reality I have to accept that I did not work hard enough fostering relationships to support everything we wanted to get done. I’m sure I made a million other mistakes along the way. I hope my learnings help you understand my perspective and prepare for your future.",
    "timestamp": "Thu, 06 Apr 2023 19:57:52 +0000",
    "url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852/3",
    "is_root_post": false,
    "topic_title": "FDD Workstream Dissolution Details",
    "topic_url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852"
  },
  {
    "post_id": "13852-2",
    "author": "Kritikal_Eye",
    "content": "HI Joe, Thanks for this post. It seems like it is your good way of framing your opinion of the FDD workstream legacy, and maybe positioning it for possible future Retroactive Rewards. I am curious if you have anything you’d do differently if you could do it all over again? Do you have any constructive criticism for yourself? Id certainly feel more comfortable voting for retroactive rewards for FDD in the future knowing those answers. (Posting this with a throwaway account because I am not comfortable doing it otherwise + anonymous accounts are not against the Forum Code of Conduct. I hope that is okay!)",
    "timestamp": "Thu, 06 Apr 2023 19:30:30 +0000",
    "url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852/2",
    "is_root_post": false,
    "topic_title": "FDD Workstream Dissolution Details",
    "topic_url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852"
  },
  {
    "post_id": "13852-1",
    "author": "DisruptionJoe",
    "content": "The Fraud Detection &amp; Defense workstream has come a long way since its ideation in May 2021 and inception in August of 2021 . As one of the first workstreams, it helped to create a pathway for other workstreams to follow. In my view, the work of FDD over the past couple of years has been a highlight of Gitcoin and what DAOs can do in general. We stopped over $3 million in fraud with unknown amounts deterred. We started and spun out Support, DAOops, and Grant Eligibility functions as we found solutions for managing the sybil problem. Gitcoin is providing a way for people to collectively make decisions that aren’t pure plutocracy (1 token = 1 vote) in a legitimate and credibly neutral way. When someone says “I want to run my rounds like Gitcoin does” they are indeed saying “Gitcoin has the only mechanism which has delivered decentralized funding decisions at scale in a way that the community trusts”. We learned that the reason sybil is an unsolved problem is because all known solutions involve trade-offs. The work of FDD is now complete because tools &amp; processes for communities to choose either side of these tradeoffs now exist. Not only do they exist, but we have also built &amp; launched the processes and communities needed to continue the research &amp; development cycle without us. The launch of the Allo protocol, GrantStack, and the maturity of Passport are signals that the time for FDD is done. A centralized entity should no longer be in control of detecting or sanctioning fraudulent behavior. This function now lies with the communities running rounds and the service providers who support them. We hope the ability to use the tools and processes we have developed will continue Gitcoin’s reputation as a trusted way for communities to fund what matters. As the workstream winds down, we’d like to help the DAO smoothly transition through the dissolution of the FDD workstream and the transition to have fraud defense a vital part of end-to-end accountable product workstreams. To accomplish this, we are going to cover the following: What we accomplished Sybil Management Solution Project Highlights What we are doing this season Quick FAQ S17 roadmap People transitions Accounting closure What we learned which may still be of use Data Infrastructure Sybil detection Grant eligibility Decentralization What We Accomplished Gitcoin has stopped $3 million in fraud since season 9, most of that coming from FDD. Over 30,000 human evaluations of algorithmic policy determinations Performed over 15,000 grant reviews for fraud &amp; initial round eligibility Mitigated over 250 disputes Judged over 100 appeals Gitcoin is the shining light in web 3 that shows people something other than pure plutocracy is possible. It is the only mechanism that has scaled a system other than 1 token = 1 vote for distributing funding. People believe in Gitcoin because they have seen $50 million in funding with a relatively small amount of harm due to fraud. Trust is the product Gitcoin provides. Created a Solution for Managing the Sybil Attack Problem The Sybil Scoring Legos System for continued sybil defense is the needed tool to compliment Gitcoin Passport’s ability to gate rounds. We learned that the participants of each round have unique properties. Some of these work well with a gating/weighting system. Some do not. The solution for managing sybil attacks requires the ability to detect malicious behavior during the round. Most importantly, any decision made using data during the round must be reproducible. This includes using transparent and auditable code, data version history from the time the data was collected, and a provenance guarantee. Sybil Scoring Legos System has the following properties: Transparent and auditable data pipeline for algorithmic policy decisions Allow for a non-technical user to identify the violated behavior Reintroduces explainability underneath ML algorithms used to scale Composability in ML algorithms allow fast updates when new attacks are found Anyone can build productized algorithms and interfaces using OS code Crowdsourced research &amp; development to continually assess validity “Kerckhoff Compliant” system design made possible by being fully open Highlight Projects &amp; Accomplishments First DAO to run a Machine Learning Operations (MLOps) pipeline First DAO to execute a (politically) decentralized conflict resolution process with our appeals escalation process for grant rounds Started and spun out Support, DAOops, Onboarding, and Grant Eligibility Launched the OpenData Community - a community fighting sybils &amp; protecting web3 from capture at the data layer: https://opendatacommunity.org/ A first opted-in and consented graceful wind down of a DAO workstream Ran on budget with industry leading transparency for 7 seasons Created an ethical transparency mechanism in the FDD Review Provided support for other teams including first trust bonus algorithms for Passport, Financial Audits for DAOops, and Grant Reviews for PGF Started the workstream with a multisig counsel of experts to protect Gitcoin funds First workstream to voluntarily decrease budget on steward request First workstream to provide funding options to stewards in a vote Returned 100% of reserves to treasury EVERY season Only workstream which didn’t increase budget request amount when CSDO made agreements to keep budgets flat What We Are Doing This Season Quick FAQ When will FDD dissolve? FDD will officially dissolve on April 28th. We’ll host a community call the 26th of April to do a public retro and celebration of this workstream’s work. All core contributors who have new priorities within other workstreams have already been embedded into the necessary meetings during the last several weeks, and these contributors who have been hired-on by new workstreams will have their official hand-off to new leadership beginning April 7th. It is understood that these contributors will continue their efforts to wind-down FDD while also gaining context and making an impact in collaboration with their new workstreams. How will FDD be funded through S17 since the budget request was not granted? Due to some savvy treasury management tactics and independent funding sources, FDD still has ample funds to continue the work that was originally proposed in the S17 budget request. The additional funds requested in association with this budget were declined during a new vote appeals process pioneered by the Steward’s Council last Monday; however, thanks to the total amount of reserves and surplus funds, FDD is still able to complete the season uninterrupted… Since the overwhelming consensus was that FDD’s budget strategy was in-line with the DAO’s desires, but the funding mechanism was in question, FDD leadership believes the best course of action is to utilize remaining funds in the service of those strategic outcomes already agreed to and voted upon by the DAO. So what happens during S17? We’ve only got one more month! We have already made good headway on many of these initiatives outlined in the S17 budget. FDD expects all deliverables to have been completed by April 28th. All core and part-time contributors who are working directly towards those deliverables will be paid through until that point. In any cases where contributors and the DAO decided to part ways, severance has been paid or will be paid at such a time as that contributor’s work ceases to directly contribute to those key deliverables. What about sybils…? As Gitcoin is absorbing risk as a mindset within all of its remaining workstreams, sybil-detection and anti-collusion work will continue to live within Passport’s roadmap, Allo’s systems’ design, and PGF’s core trust and reputation work. Season 17 Roadmap Continued Trust in Gitcoin’s Ability to Prevent Fraud Data informed recommendations to mitigate fraud are made continuously available. Fantom &amp; Gitcoin Alpha Round Recommendations Fantom required a lot of back and forth work Alpha rounds completed - Overview here A Scalable Mitigation Sybil Solution Exists Sybil Scoring Legos System docs Sybil Defense Innovation &amp; Insights Continue after FDD Open Data Community 2nd hackathon funded 39% by Gitcoin ODC will conduct the 3rd hackathon which runs mostly after FDD season is over ODC will maintain the research and development cycle for legos Passport has Analysis &amp; Data Science Support Provided job description suggestions Provided analysis &amp; data science support for reweighting the algorithm Recommendations to Correct Web2 Vulnerabilities are Followed Through Followed through with product team to find solutions Empowering the DAO with Open Data, Infrastructure, &amp; Processes Data processes &amp; pipelines are reliably available &amp; maintained. An On-chain Data Extraction Solutions that Meets the Needs of Real-Time Anomaly Detection Nodes have been delivered Stack includes Erigon archive node w/ Trueblocks Open and Decentralized Data Repository for the Community All data can be found at https://fddhub.io/ Gitcoin Analytic DB &amp; Query Interface Being worked on by Zen, Baoki, &amp; Alex Goal is to pull in the node data allowing for realtime anomaly detection FDD Workstream Dissolution Success FDD contributors and work is smoothly transitioned and/or shut down. Successful Transition of Contributors Documented below Two contributors still unsure of placement Clearly Documented Closing of Accounts &amp; Obligations Final plans agreed upon in FDD and shared to CSDO Creating FDD MolochDAO for any future airdrops or other value unlocks A Proposal for a Ratified Process to Spin-Out “Investible Workstreams” Joe handling this objective Multiple model potential - Working on JokeRace to propose best model Current front running models Onchain SAFE/SAFT for subDAOs by Joshua Tan Proposal Inverter spun out from Developer DAO &amp; TEC Pure Mutual Grant vote People Transitions FDD talent will be moving to new opportunities, some with other workstreams and some outside of Gitcoin. Here we aim to inform you of next steps for each current member of FDD. These members will be transitioning to other workstreams and their transitions have been confirmed by the person listed: Alex - Sr. Fraud Analyst &gt; PGF Program (Maxwell) Baoki - Data Analyst &gt; Allo Protocol (Nate) Zen - Data Engineer &gt; Allo Protocol (Alex/Kevin) Sorana - Operations/Analyst &gt; Allo Protocol (Kevin) J-Cook - Technical Writer &gt; DevOps (Zakk) These members will not be moving forward with a Gitcoin workstream. Disruption Joe - Workstream Lead (Last day 4/28) Not pursuing a future role with a Gitcoin workstream. Launching Plurality Labs, a service organization intended to help communities utilize the tools built by FDD and manage governance and grants programs. Will likely participate in the Round Operators program. Last projects include successful management of transitions, accounting wind down, and bringing a proposal for investible workstreams to the DAO. Tigress - Workstream Lead (Last day 3/24) Not pursuing a future role with a Gitcoin workstream. Received a recommendation letter for her next opportunity. Last project finished as she handled operations through EthDenver and had her final day after prepping for the winddown. OmniAnalytics - Data Scientist (Last day 4/28) Not pursuing a future role with a Gitcoin workstream. Open to future project-based scopes of work in contract with Gitcoin. Has OmniacsDAO focused on making data science a public good. Last project involved assisting in data scraping for the Alpha rounds, passport reweighting, and a behavioral analysis of onchain data. Evan Powell - Operator Not pursuing a future role with a Gitcoin workstream. Choosing to continue the work of the Open Data Community to achieve sustainability. The Open Data Community will run its third hackathon even though the FDD season technically ends on 4/28, though the hackathon will run from 4/25 to 5/30. Potential to create a GCP for Gitcoin to be an official founding member as they launch governance. Non-core Trusted Members Yogeesh - Part time software engineer (ML) Eric - Part time software engineer Adebola - Former core on Project-based scope this season Accounting Closure FDD has 2 main wallets and at times have used EOAs for trading. Trading EOAs do not hold funds for any extended period of time outside of the duration of the trade other than a few hundred for gas. FDD Primary Multisig 4/7 - Currently holds $0 The primary FDD multisig had its full amount sent to the operations wallet at the beginning of Season 17. To ensure our ability to meet commitments, the entire balance was then traded to stablecoins. FDD Operations Multisig ⅔ The operations wallet has the rest of the FDD treasury. The last salary payments will go out on 4/10. Payments for the last 3 weeks of the season will have been fulfilled via double payments the previous 3 weeks. Leftover Funds After Final Payroll Funding of approved travel &amp; personal development expenses Hosting a Featured Round during the Gitcoin Beta round with Summoning a MolochDAO for FDD members to own any future value We would love for you to join us for the summoning ceremony which is tentatively scheduled for 4/26 during our farewell FDD celebration event during the Gitcoin community call. What We Learned Which May Be of Use Data Infrastructure In an org which aspires to transparency, the need for data quality assurance and pipeline management best practices goes beyond the DAO. Our community members and stakeholders have a vested interest in learning from our grants rounds; we are pioneering QF in many ways, and before Gitcoin can share take-aways and establish greater thought leadership in this emerging discipline, we must be clear on our own methodologies and exercise greater tracking and versioning control on our datasets. On-chain data and self-sovereign databases are a non-negotiable in a world where governments and government-sized cloud storage providers disrupt the data availability we all depend on. We can learn from some high-profile errors of web3 projects of late: we need to be the experts in our own ecosystem. To do this, we have to set up enterprise-level anomaly detection and adopt a risk mindset throughout the org. Grants Partners trust us with funds with the understanding that we can safely and fairly distribute those funds: a prerequisite to guaranteeing their safety and keeping their trust is to monitor for new and emerging exploits. It’s a high quality problem, but to scale and lean into the hypergrowth that Gitcoin is headed towards, we cannot continue the level of manual analysis which we have conducted in the past. Whether it’s PGF reviewing grant applications or FDD reviewing sybil rings: we need to prepare automated tactics utilizing statistical analysis to free up our contributors to do their best work at scale. Sybil Detection FDD has done ample research and employed many partners in solving the sybil problem for our ecosystem. While sybil research and on-chain identity is an ongoing topic throughout the web3 space, the bottom line is: Gitcoin knows how best to protect its own grants rounds. Statistical analysis allows us to detect and silence votes where there is evidence of script-execution of grants support or recycled funds in play; with the new availability of on-chain signals, we can positively ID supporters who use the same funding mechanism or execute identical heuristics across wallets and be sure that their votes are counted only once per unique identity. The wider community remains fascinated by the problems of sybil detection, and with the cleaning of Gitcoin and FDD datasets, we can provide a wealth of information and access to these budding sybil slayers. We are excited for the models and solutions to come that build on Gitcoin’s expertise to further articulate the nature of these exploits. Sybil Scoring Legos will likely need to be connected to Passport. This may be through another community or company attesting to wallets that participate in a round or Gitcoin itself. Gitcoin might hold a list of ineligible wallets for its own program, but this is not universal. Passport is a great solution for gating/weighting user participation in votes. However, Gitcoin must enable transparent and auditable analysis based decision making which scales based on users behavior in a round. This is because of the adversarial nature of sybl defense. It is also necessary to provide a choice to program managers. While adjusting the results of a vote after votes are cast (retroactive sybil discounting) seems more unethical than gating access using Passport, the compounded effect of gating is arguably more unethical. Any inherent biases in the stamps available and peoples ability to pass the gating will compound over multiple rounds and holds the potential to speedrun building inequality. Offering a choice allows program managers to own this decision and users can “vote with their feet”. Grant Eligibility Grant Eligibility and the larger question of verifying grantee reputation on an ongoing basis is one area within which there are huge automation opportunities The NLP based work already pioneered by FDD can be found here . For beta rounds, increased automation will be trialed and proactive as well as retroactive QA checks will be in place so that we can develop a way forward. Stay tuned! It is likely that a review protocol which incentivizes accurate reviews could cthange reviewer optimal strategy. If a user has a grant in 1/n rounds but is reviewing grants (Not for eligibility to a specific round, but validating individual attestations about a grant) then their likelihood of reviewing something relevant to themself is lower. We should push for separation of reviewing grants for possessing qualities and then matching those qualities to the rounds they are eligible for as this system scales better and creates better data for studies across ecosystems. A review protocol might find that holders of certain stamps might perform better at reviewing correctly. We looked into this with our Ethelo review experiment in Season14. The data can be found here. Decentralization In any situation where decisions must be made by the community, the decision can be made in the following ways: Delegated authority to an individual/committee OR a weighted input model. Weighted input models can represent the community. Our reward modeling research in season 13 shows that it is possible to find “minimum viable decentralization”. This is the number of reviewers needed to ensure the outcome is in alignment with the desire of the community provided an assumption of less than ⅓ bad actors. Simulation Github . All algorithmic and human decisions require an appeals process to maintain legitimacy. This is because there is always a potential for criteria being written in a way that multiple ways of reading it can both be considered reasonable. There are also situations where the external environment changes in a way that requires the community to reconsider previous decisions. Retroactive sybil discounting and any other algorithmic policy enforcement must be transparent and reproducible. As long as there is a functioning appeals process, the decisions can be made off-chain with an optimistic assumption which can be challenged. In Conclusion We started with a belief that a high-resolution democracy should better incorporate the will of the governed. We no longer need to delegate authority to single points of failure, incompetency, or corruption. Instead, we can provide systems of minimum viable decentralization that truly capture the will of the participants. This ended up being at odds with the structure of the DAO after the bear market brought us concerns around sustainability. The wartime DAO decided to lean in on efficiency. To minimize risk and to focus on delivering the most important thing - Allo protocol. Only upon delivering the Allo protocol have we found the truth behind what value Gitcoin is truly providing - a trusted way to use funding mechanisms which are susceptible to fraud. A bear market pushed the DAO to move to sustainability mode and had us drop multiple important projects at FDD such as decentralizing the user and grant review processes. This is a problem because the promise is corruption free public goods funding, but when only one actor is delegated authority it provides a single point of failure. We had hoped to have this ready when the protocol was launched. Choosing to not fund this work is understandable when you think of the protocol as the rails for public goods funding, but not when you think of it as corruption proof public goods funding. Hopefully, the launch of the protocol and new DevRel efforts will have the community innovating solutions to this and other similar challenges. Going forward, we’d advocate for the DAO to consider all the ways a grant program can be captured or corrupted. The timing for FDD to wind down is perfect. The community is empowered by the protocol launch and they have the solution available for managing the sybil problem. Members of FDD moving into end-to-end accountable workstreams is already bringing data-first thinking to the product which we expect to provide incredible benefits. We hope that FDD is seen as a shining example of a graceful wind down of a workstream setting an example for all of web 3. We thank all the token holders, stewards, and DAO contributors who supported us. Special thanks to Christine &amp; Tigress for setting up &amp; driving our operations respectively. @ChrisDean @tigress A big shout out to our original multisig keyholders who took a chance early on. @mzargham @akrtws @lefterisjp @tjayrush @bobjiang @octopus To all our contributors, core trusted and part time, THANK YOU. I can only tag 10 total so I’ll stop here!",
    "timestamp": "Thu, 06 Apr 2023 12:41:47 +0000",
    "url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852/1",
    "is_root_post": true,
    "topic_title": "FDD Workstream Dissolution Details",
    "topic_url": "https://gov.gitcoin.co/t/fdd-workstream-dissolution-details/13852"
  },
  {
    "post_id": "15533-1",
    "author": "Hi everyone, Joel from the [Q.E.D. program](https://gov.gitcoin.co/t/gcp-010-evolving-gitcoin-grants-the-q-e-d-quadratic-experimentation-and-development-program/14174) here. Today marks two weeks into the program, so it’s time to update you all on our progress. I’m going to focus on two big lessons we’ve learned so far, and then give two brief technical updates.",
    "content": "Hi everyone, Joel from the [Q.E.D. program](https://gov.gitcoin.co/t/gcp-010-evolving-gitcoin-grants-the-q-e-d-quadratic-experimentation-and-development-program/14174) here. Today marks two weeks into the program, so it’s time to update you all on our progress. I’m going to focus on two big lessons we’ve learned so far, and then give two brief technical updates. **Lesson 1: translation isn’t just technical** Our goal with the Q.E.D. program, in a nutshell, is to adapt state-of-the-art QF research for use at Gitcoin. But you can’t just immediately take the mechanisms from research papers, plop them into python, and then call it a day (although [I did do that](https://github.com/Jmiller4/plural-qf), if anyone’s interested): translating between the world of pure math (where QF whitepapers live) and the real world requires a lot of technical adjustments. We were expecting this. What I wasn’t expecting, however, is that QF isn’t just an algorithm that web3 communities like because it has appealing mathematical properties. It does have nice properties, of course, but in my time reading forum posts and talking to community members, I’ve gotten the impression that folks also like QF for more intuitive reasons. I’ve heard people say they like QF because it’s egalitarian, democratic, empowering… Based on the qualitative research on the topic, it seems to me that QF serves as a mirror for the community’s values: the community co-creates an implementation of QF, sees if the outcome matches their intuitive idea of what should be happening, and then adjusts accordingly for the next grants round. Because of all of the intangible value propositions, translation can’t just be about the technical details. We have to also make sure that our work syncs up with the Gitcoin community’s idea of what QF should be. To that end, I’m requesting community input so that we can really flesh out our understanding of how the community intuitively thinks about QF and make sure the Q.E.D. program provides the maximum possible value. If you have time, please visit this [polis conversation](https://pol.is/7hskapnxhm) and let us know what you think. Additionally, I’d love to have one-on-one meetings with anybody who’s interesting in taking a deeper dive – to set one up, email me at joeldmiller73@gmail.com. **Lesson 2: collusion resistance can be private or public** I’ve learned that Gitcoin has a few cool ways of dealing with sybil networks. Previously, Gitcoin’s fraud defense team implemented sybil defense measures that were kept relatively private, in order to keep bad actors from adjusting their behaviors to avoid censure. On the other hand, Gitcoin Passport provides what I would call a more “public-facing” approach to sybil resistance, where rules are out in the open. Both approaches have advantages, and as we try to understand how to implement anti-collusive QF, this distinction presents the first obvious crossroads. Do we want to keep the rules of our implementation relatively private, or make them public? While we’re open to re-negotiating this issue, right now I strongly feel that our implementation should be public. A public implementation will allow for much easier integration with Passport and other like-minded products in the web3 space, and on a more fundamental level, it better aligns with my belief that social diversity (the backbone of anti-collusive QF) is something to be celebrated and encouraged, rather than something to be hidden away. **Technical update 1: Metrics for assessing outcomes** Assessing the differences between outcomes from different QF rounds will be an important part of our analysis. Based on some conversations with members of the data guild, it looks like a metric inspired by [earth-mover distance (EMD)](https://en.wikipedia.org/wiki/Earth_mover%27s_distance) will work well. For our purposes, we can think of EMD as a measure of distance between two different sets of funding amounts: intuitively, the EMD is the total amount of money one would need to move around between various projects to get from one set of funding amounts to the other. For example, suppose that in a world with only two projects competing for grants funds, I could run algorithm A, which gives both projects $100, or algorithm B, which gives one project $50 and the other $150. Then the EMD between these two outcomes is 50 – since if you start with the outcome specified by algorithm B, then move $50 from one project to the other, you get the outcome specified by algorithm A. The [most general definition of EMD](https://en.wikipedia.org/wiki/Earth_mover%27s_distance) is a little complicated, but for our special case, it’s easier to define. Let f(*p*,A) be the amount of funding given to project *p* in outcome A. Then our EMD-inspired metric can be defined more simply as EMD(A,B) = ½ Σ*ₚ* f(*p*, A) - f(*p*, B) where \"Σ*ₚ*\" denotes a sum over all projects *p*. EMD becomes useful when you have some approximate idea of what “should” happen – in this case, some idea of the socially optimal allocation. If you can estimate that, then the EMD between algorithm X’s allocation and the socially optimal allocation is a great metric for evaluating algorithm X. I’ll talk more about how we can estimate socially optimal allocations in the next update. *Extra info for nerds: if you think of an allocation outcome over n projects as a point in n-dimensional space, then the EMD between outcomes A and B is closely related to the L1 distance (or “manhattan distance”) between the “point” versions of outcomes A and B. But thinking of outcomes as points opens you up to many more distance metrics, for example, L2 (euclidean) distance. So really, there are many closely related metrics to choose from.* **Technical update 2: Python tool for minimum distance on the Ethereum network** As I began to dive into the Ethereum data, I found it useful to whip up a simple python tool to query the “distance” between two wallets, where distance is measured in degrees of separation between wallets – i.e., if wallet P transacted directly with wallet Q, the distance between P and Q is one. If wallets Q and R also transacted, but wallets P and R never transacted, then the distance between P and R is 2. I’m sure many have already coded up similar tools, but if anyone is looking for a simple implementation, you can find my code in a google [Colab notebook](https://colab.research.google.com/drive/1A-iibp5lAmhnmhHbOjgBWX3bUfYLKv_7?usp=drive_link) or on [GitHub](https://github.com/Jmiller4/ethdistance/blob/main/ethdistance.py). That’s all for now. If you have any feedback please let us know in the replies, and if you want to chat one-on-one about QF, please reach out to me via email ([joeldmiller73@gmail.com](mailto:joeldmiller73@gmail.com)). Thanks!",
    "timestamp": "Fri, 30 Jun 2023 08:16:09 +0000",
    "url": "https://gov.gitcoin.co/t/q-e-d-program-update-1-request-for-community-input/15533",
    "is_root_post": true,
    "topic_title": "Q.E.D. program update 1 + request for community input",
    "topic_url": "https://gov.gitcoin.co/t/q-e-d-program-update-1-request-for-community-input/15533"
  },
  {
    "post_id": "15610-1",
    "author": "![|720x171](upload://1EexqBZKZCTX3G90D24pom4SrS8.png)",
    "content": "![|720x171](upload://1EexqBZKZCTX3G90D24pom4SrS8.png) # 🔥 Hot Topics: * @Joel_m shares a [progress update about the Q.E.D. program](https://gov.gitcoin.co/t/q-e-d-program-update-1-request-for-community-input/15533) after two weeks in, covering the lessons learned and providing technical updates on the metrics for assessing outcomes and Python as a tool for minimum distance on the Ethereum network. * @kyle shares a GTC recap, highlighting how the organization has evolved from being a platform for experimentation to a decentralized protocol and community only after two years of its launch. [Read the full post](https://gov.gitcoin.co/t/gtc-after-2-years/15567) to gain a holistic perspective on the developments and learn more about how the GTC governance token is now being utilized. * @epowell101 is seeking $65,000 from the Gitcoin Treasury to support the OpenData Community (ODC), a non-commercial DAO dedicated to protecting public goods funding and supporting decentralization at the data layer. [Check out the proposal](https://gov.gitcoin.co/t/proposal-opendata-community-gitcoin-founding-role-and-request-for-support/15592/1) to learn how the funding will enable the delivery of complementary open-source and free-to-use software, algorithms, analysis, data sets, and data scientists for users of Gitcoin protocols. # 🧭 Weekly Workstream Update Here are key highlights from the [weekly workstream update](https://docs.google.com/presentation/d/1WJseBI_raaBPhZFxTD-ProPvb9e9Ay-6vzWSERKmgmY/edit#slide=id.g24f27bb2388_1_10) - (video [here](https://www.youtube.com/watch?v=-vxBzhmjbZQ)) ## Allo + Grants Stack: * Drip campaign continues this week on Allo Twitter. EthCC/FTC Stickers are now available! * Keep an eye on key dates in the targeted timeline for Allo V2: testnet launch around July 25th, audit start around August 7th, and mainnet launch around September 1st. * MVP versions of Project Registry and Allo core are finished and the team is sprinting towards an MVP of the completed flow by EOW once the protocol fees are figured out and finalized. Whitepaper draft in progress will be shared next week. * The architecture revisit has led to significant upgrades, including the migration from factory to Singleton pattern (a similar approach to Uniswap v4), the expanded functionality and flexibility of the project registry to make our lives easier from round to round (rounds will be referred to as pools on a protocol level). * Endaoment Integration for QF [(GPC) is live](https://gov.gitcoin.co/t/gcp-013-seed-universal-impact-pools/15398), enabling donor-advised funds to hold GTC to receive and make donations. Check out the portfolios displayed [on their app website](https://app.endaoment.org/portfolios). * Impact Stream is building tooling to run QF rounds on developing countries, starting with Togo, Africa. “Call to Build” article writing is underway, aiming to provide an overview of the architecture and how the core components of the Allo V2 protocol work. * AIP-13 has been implemented in Allo contracts to enable multi-round checkout and contracts deployed to PGN testnet. The design document of the multi-round checkout contract has been audited. Researching new methods for adding matching estimates. * Upcoming focus on adding support for PGN testnet, deploying Subgraph to PGN testnet, building multi-round checkout contract, finalizing designs for Multi-round checkout, building matching estimates into checkout flow, and improving multi-round checkout UI. * Check out the [Allo Brand Design Elements](https://gitcoin.notion.site/Allo-Brand-Design-Assets-1b6372032fcf434da3961bc3591261e6) with updated slides, animations, illustrations, and banners. Refined graphics, stickers for FTC Paris, and the brand book and forum post are in progress. [V1 of Brand Book](https://www.figma.com/file/IYFgcVtZPebMxTuUWea4W7/Gitcoin-Grants-Stack?type=design&node-id=339-551&mode=design) is complete! * Check out the new [Manager Toolkit](https://manager-toolkit.super.site/): your guide and inspiration for running a Quadratic Funding grants program. * Support Ticket Stats (June 19-25) decreased: 541 new tickets via live chat and 45 new tickets via email, revolving around Passport stamps -ENS, NFT, GTC Possession stamps. Use support@gitcoin.co or [intercom](https://intercom.help/gitcoin/en/) for filing issues. ## Public Goods Funding * Strategic planning including exploring new revenue generation and scalability models for public outreach and support by establishing a “top of funnel” program with the partnerships team. * The final round of manual review has been finalized, and the lessons learned from the Beta round process are being incorporated into future review plans. * Next program round will be in August (Gitcoin Grants 18 - GG18). Planning is in progress for the core rounds as well as revenue generation mechanisms for community and sponsored rounds. * Azeem was a Guest lecturer at Questrom School of Business at Boston University. He was asked [to be an Advisor to Foresight Ventures](https://cointelegraph.com/press-releases/head-of-impact-at-gitcoin-azeem-khan-joins-foresight-ventures-advisory-board). * Report on the future of global fintech in collaboration with WEF and Cambridge University Business School coming soon. * Next Gitcoin Grants Program Round (Season 18) pushed from July to August. More to come on the process and structure of Core/Featured rounds. Process for selecting the core rounds and adding featured rounds in progress. * A [simplified CRM](https://www.notion.so/gitcoin/Simple-CRM-2e86cf87f0724077aa6f4deec843722e?pvs=4) entirely built in Notion to bring spatial awareness, track partnerships, business development efforts and integrate institutional knowledge. ## Passport * The focus remains on reducing support tickets while improving UX scalability not only for users but also for integrators based on load testing and rearranging documentation content. New partnerships are interested in pushing the Passport creation for load testing (1m-5m passports/ day). * Revamping stamps that are not effective at removing sybils, closing down attack vectors from Github and others currently present in the system. * Multiple case studies are in progress and already receiving positive feedback. Publishing {r}elinked case study this week. Discourse plugin development is in progress. * Announcing new stamps this week. Campaigns for Galxe and On-chain Stamps are under planning. * Passport Brand revisions continue in progress (the cross-functional working group has been activated to ensure alignment between mission, vision, and marketing assets). * [Release Notes #10](https://gitcoin.notion.site/What-s-New-Gitcoin-Passport-4764ed4f8a3f42fdbd2d5d7dd8637872) is now available. * Snapshot integration has been migrated from SDK to API, documentation and adoption strategy are in progress. Recent or upcoming integrations include: {r}elinked, Thrivecoin, Linea, Collab.land, newcoin/newlife, and Metaforo. * @0xZakk published his first developer-focused [video walkthrough of the interactive score API docs](https://www.youtube.com/watch?v=TDJLFx-gfiM) and is working on a bounty for a set of Prebuilt Passport components that will be covered in a future video. [Subscribe here](https://www.youtube.com/@0xZakk) to stay up to date on his weekly video guides. * Content simplification is in progress, including the creation of a Data dictionary to define what fields deliver via the API as well as ongoing Information Architecture reviews, such as the recent update for the rate limits on the endpoint definition page. * Major improvements will be reflected in new documentation structures and upcoming tutorials, including: moving the docs hosting platform over to Nextra, IA content overhaul, merge user content into a support knowledge base, and airdrop example app. * Supermodular team has built a [Passport-gated faucet starter](https://gc-passport-faucet.vercel.app/) that can be forked and run on any network. Prebuilt Passport components are under planning. * Linea campaign in progress, featuring [the new zkEVM L2 created by ConsenSys](https://consensys.net/blog/news/consensys-launches-private-beta-zkevm-testnet-to-scale-ethereum/). Running weekly Voyage Quests (7 so far). New quest to remove bots & Sybils, Passport is one of 3 options including: Guild Pin, Galxe Passport (KYC + SBT mint). 480k total net new Passports created since the campaign started. * The current influx of new Gitcoin Passport holders has resulted in additional GTC staking with a max stake of 404k GTC in the last week. We are also seeing the number of integrations increase from 7 at the start of the season to a total of 15 integrations. ## MMM * Since #GitcoinBeta ended in May, we have embarked on an exciting journey that enhances our existing offerings and accelerates innovation. Get up to speed and share the new thread on [WHAT WE’VE BEEN UP TO AT GITCOIN](https://twitter.com/gitcoin/status/1670892624008364032). * Research & Impact Hub has been updated with project tracking, proposal ideas, and GCP & RFPs process. Current research underway: State of Web3 Grants, State of QF, exploring new research opportunities such as reputation systems and coordination mechanisms * Ongoing updates: sunsetting cGrants, EthCC planning (SP House, FTC & Gitcoiners coming together), [Passport visual touch-ups](https://docs.google.com/document/d/1rfPmfVDceQze8DNAUmCEsbk3YXoUjP8IgEZ5oU6biaU/edit#), Gitcoin Grants and PGN brand work are underway. * Gitcoin Grants is the word of the week, defined as the largest Quadratic Funding grants event in the world. Check out the [shared glossary](https://gitcoin.notion.site/Gitcoin-Glossary-287c54d3538941349b397cdf8ced4ca1) of terminology where the DAO documents common language and reinforces our shared vernacular. # 🗳️ GitcoinDAO Governance Overview: Snapshot polls GTC Stewards. Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally. ## 📊 Active Proposals: * Withdraw & leverage partial USDC - [Go vote on Snapshot (closes Sunday)](https://snapshot.org/#/gitcoindao.eth/proposal/0xf9de1c0ec62b82ca36a55eb3e5334b481d3027a1c025a328244c78b0bb04412a) * [GCP-013] Seed Universal Impact Pools - [Go vote on Snapshot (closes Wednesday)](https://snapshot.org/#/gitcoindao.eth/proposal/0xac93297544ef49584d4c9360ef79955add4576428c81609c4b56b3f908cc425f) * [[Discussion] Ratify the Results of Gitcoin’s Beta Round](https://gov.gitcoin.co/t/discussion-proposal-ratify-the-results-of-gitcoin-s-beta-round-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/15166) * [[Proposal] Seed Universal Impact Pools 1](https://gov.gitcoin.co/t/proposal-seed-universal-impact-pools/15398) * [[GCP-009] - Upgrading Gitcoin’s Governance Contracts](https://gov.gitcoin.co/t/gcp-009-upgrading-gitcoin-s-governance-contracts/14010) * [[Proposal] DeSci “recognized subDAO” framework](https://gov.gitcoin.co/t/proposal-desci-recognized-subdao-framework-development-and-implementation/15460) * [[Proposal] -Schelling Point Istanbul](https://gov.gitcoin.co/t/proposal-schelling-point-istanbul/15260) ## 📅 [Upcoming events](https://gitcoin.notion.site/Upcoming-Events-d749e53de96147a88a2f4864ea381afc) Gitcoin Community Call: Weekly discussions to seek community opinions on the latest DAO decisions happen every Wednesday @ 12 pm ET. Catch up on recordings of recent conversations here: * June 28: [DAO leadership and public goods funding](https://twitter.com/DexeNetwork/status/1673284992430927872?s=20) * June 22: [Decentralized Design](https://twitter.com/i/spaces/1BRKjZYynAWKw) * June 21: [Funding the Commons in Paris](https://twitter.com/gitcoin/status/1671232478483451907?s=20) # 👋 New to Gitcoin? * Explore the future of Gitcoin at [our new website](https://www.gitcoin.co/), and check out [Gitcoin Community Hub](https://community.gitcoin.co/) for key resources and events. One more thing! ​The 6th edition of [Funding the Commons](https://fundingthecommons.io/) will take place on 15-16 July in Paris, France. Use the coupon code GITCOINER to get 35% off the tickets - limited spots remaining! Thanks for reading! PS: Click [here](https://share.hsforms.com/1qr4-szfGQAmHKqItMstzoAd0r2h) to subscribe to the DAO Digest",
    "timestamp": "Thu, 29 Jun 2023 15:19:47 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-12-2023/15610",
    "is_root_post": true,
    "topic_title": "Gitcoin Digest #12 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-12-2023/15610"
  },
  {
    "post_id": "15516-1",
    "author": "Thanks @gaoa97 for another detailed overview!",
    "content": "Thanks @gaoa97 for another detailed overview! # 🔥 Hot Topics: * @Zack shares a proposal seeking approval of $60,000 in Eth from Gitcoin’s matching pool for [a grant to fund Endaoment’s Universal Impact Pools](https://gov.gitcoin.co/t/proposal-seed-universal-impact-pools/15398): a novel mechanism for matching donations to nonprofit organizations and a collaboration between Endaoment.org and Gitcoin’s Allo Protocol. * Gitcoin has been invited by the Lit Protocol team to participate in the launch of their testnet and mainnet by operating a Lit Node. Read [@Kevin’s post](https://gov.gitcoin.co/t/lit-protocol-network-participation/15416) to learn more about the motivation and considerations for integrating with Lit Protocol, which is an important key management protocol integral to the privacy features of the Gitcoin Grants Stack. * Building upon the work done in S17, where DeSci was established as the first community-operated featured round within the new Gitcoin Grants Program. @Boris shares a proposal explaining the work required [to enable ongoing support for DeSci within the Gitcoin grants program](https://gov.gitcoin.co/t/proposal-desci-recognized-subdao-framework-development-and-implementation/15460), and to establish DeSci as the first of several potential subDAOs within Gitcoin. * Kyle proposes[ to move 3M USDC from the treasury, into the CSDO multisig](https://gov.gitcoin.co/t/proposal-withdraw-and-leverage-partial-usdc-balance-in-treasury/15484) for the purpose of supporting workstream’s budgets to enable the exchange of GTC with USDC from the multisig instead of open markets, with the goal of reducing the amount of GTC leaving the DAO. # 🧭 Weekly Workstream Update Here are key highlights from the [weekly workstream update](https://docs.google.com/presentation/d/1WJseBI_raaBPhZFxTD-ProPvb9e9Ay-6vzWSERKmgmY/edit#slide=id.g24f27bb2388_1_10) - (video [here](https://www.youtube.com/watch?v=MJ6Wc5aFWTo)) ## Allo + Grants Stack: * Allo v2 GTM is now in effect, shifting the narrative from QF to position Allo as a platform for unlocking the mechanism creation flywheel. * Gitcoin is excited to finally share more details about Allo, a protocol for onchain capital allocation. [Read the announcement post](https://www.gitcoin.co/blog/allo-gitcoins-newest-protocol) to learn more about what this means for you and your community * New [Allo website](https://allo.gitcoin.co/) and [Hype Drips are LIVE](https://twitter.com/alloprotocol). Focus on generating 10+ integrations. * Check out the [Allo Brand Design Elements](https://gitcoin.notion.site/Allo-Brand-Design-Assets-1b6372032fcf434da3961bc3591261e6) with updated slides, animations, illustrations, and banners. Refined graphics, stickers for FTC Paris, and the brand book and forum post are in progress. [V1 of Brand Book](https://www.figma.com/file/IYFgcVtZPebMxTuUWea4W7/Gitcoin-Grants-Stack?type=design&node-id=339-551&mode=design) is complete! * The overall architecture of Allo V2 is about 85% complete, considering the progress made in core interfaces and contracts. Ongoing development includes specifications for an initial list of strategies and outlining architecture options for the project registry, protocol fees, and the multi-chain approach. * Endaoment Integration for QF is live, enabling donor-advised funds to hold GTC to receive and make donations. Check out the portfolios displayed [on their app website](https://app.endaoment.org/portfolios). * Impact Stream planning and “Call to Build” article writing are in progress, aiming to provide an overview of the architecture and how the core components of the protocol work. * The focus remains on supporting the development of Allo v2, while the documentation work is paused until further progress. * Grants Stack updated goals include: supporting 5 direct Grants, 8 easy self-serve (no QV), improving tech debt/internal scalability and running 13 QF rounds. * Donation History page MVP has been shipped, along with multiple features including: enabling rolling applications, aggregating donations by address in the Indexer, new staging environment, and other updates to support Bedrock. * Ongoing development on Indexer improvements (deploy/scalability), scoping out multi-round checkout contracts, and adding PGN support in Grants Stack. * Upcoming focus on improving the Round Application UX, and checkout enhancements (Passport integration with matching estimates, on-page checkout). * Check out the new [Manager Toolkit](https://manager-toolkit.super.site/): your guide and inspiration for running a Quadratic Funding grants program. * Support Ticket Stats (June 12-18) increased: 1510 new tickets via live chat and 67 new tickets via email, revolving around Passport stamp, scores, Twitter GTC stamps. Current escalated issue: Typo in explorer page (in progress). Share on Twitter button did not include the link (Resolved). Use support@gitcoin.co or [intercom](https://intercom.help/gitcoin/en/) for filing issues. ## Public Goods Funding * Beta round finalization with revised matching results [posted](https://docs.google.com/spreadsheets/d/1-WDK9R4h0vBGhnJtFgd1z1ISISeuIfSP26MKaDeSY5c/edit#gid=1842751536) last week, however, follow-up questions led to more discoveries of Sybil attacks and self-donors, which will be updated. Doing one more round of manual review while exploring what automation could catch these cases. * Next Gitcoin Grants Program Round (Season 18) pushed from July to August.. More to come on the process and structure of Core/Featured rounds. Process for selecting the core rounds, and adding featured rounds in progress. * Due to market conditions, Schelling Point EthCC - Paris has been reduced to a 3-day long event with 5 new partnerships confirmed: Salus Security, GoPlus, Celo, Golem Foundation, and Drips/Radicle. * Regional Inclusivity Panel under planning to take place as an afternoon session for Gitcoiners, featuring knowledgeable and experienced people from South Korea and Taiwan. New nominations are still open and welcomed in the panel. * A [simplified CRM](https://www.notion.so/gitcoin/Simple-CRM-2e86cf87f0724077aa6f4deec843722e?pvs=4) entirely built in Notion to bring spatial awareness, track partnerships, business development efforts and integrate institutional knowledge ## Passport * Holonym stamp is ready to be turned on and get a score. Upcoming updates for introducing new stamps (e.g. Idena, Civic, Humanode) in progress. * Maintenance pages and database upgrades have been completed to help with scaling. Planning in progress for Unique Humanity Score improvements, UX improvements, Ceramic ComposeDB Upgrade. * The focus remains on improving UX scalability for users and integrators based on load testing and rearranging documentation content. New partnerships are interested in pushing the passport creation for load testing (1m-5m passports/ day). * In pursuit of evolving current marketing strategies, a [win-win co-marketing approach](https://gitcoin.notion.site/Gitcoin-Passport-Integrator-Co-Marketing-Approach-June-2023-Briefing-76234d5e76514000bcf4773b1e10cdc9) has emerged as an effective method to foster ongoing collaborations with multiple orgs, including Linea/Galxe, {r}elinked, OKX. 2k new followers and 100s of thousands of impressions in the last week. * Linea campaign in progress, featuring the new zkEVM L2 created by Consensus. Running weekly Voyage Quests (7 so far). New quest to remove bots & Sybils, Passport is one of 3 options including: Guild Pin, Galxe Passport (KYC + SBT mint). 480k total net new Passports created since the campaign started. * Other Protocol updates include:Large influx of new Passports have resulted in additional GTC staking with 104k GTC staked in the last week, we are also seeing the number of integrations increase from 7 at the start of the season to a total of 14 integrations, a total of 820k all time unique Passports have now been created. * Open bounty for [building an open-source Discourse forum plugin](https://docs.google.com/document/d/10q5VGCMW76cDBui1e6ZGLwG4BWi8yItMmAE7hjCJeec/edit) that will require a user to have and verify their unique humanity with a Gitcoin Passport to gain access to the forum as well as to do different things such as post or create new topics. * Snapshot integration is still being migrated from SDK to API. Upcoming integrations include: {r}elinked, Thrivecoin, Linea, Collab.land, newcoin/newlife, and Metaforo. * Passport Brand revisit in progress (the cross-functional working group has been activated to ensure alignment between mission, vision, and marketing assets. Leading up to the ‘Protect What Matters’ campaign and other initiatives to be launched). * Multiple case studies are in progress and already receiving positive feedback on a recent one using the test faucet. Discourse plugin development is in progress. * [Release Notes #9](https://gitcoin.notion.site/What-s-New-Gitcoin-Passport-4764ed4f8a3f42fdbd2d5d7dd8637872) is now available. * Tutorials created for stamp creation process and metadata, as well as onchain stamps content (users). Work in progress for Information Architecture Review, major improvements will be reflected in new documentation structures and upcoming tutorials including: IA content overhaul, Merge user content into Support knowledgebase, and airdrop example app. * Supermodular team has built a [Passport-gated faucet starter](https://gc-passport-faucet.vercel.app/) that can be forked and run on any network. Prebuilt Passport components are under planning. ## MMM * [Grant Stacks](https://www.gitcoin.co/grants-stack) and [Allo](https://allo.gitcoin.co/) websites launched. Community Initiatives page and PGN sprint for next week. Side quest: [WTFisQF landing page refresh](https://wtf-is-qf.webflow.io/). * Since #GitcoinBeta ended in May, we have embarked on an exciting journey that enhances our existing offerings and accelerates innovation. Get up to speed and share the new thread on [WHAT WE’VE BEEN UP TO AT GITCOIN](https://twitter.com/gitcoin/status/1670892624008364032). * Research & Impact Hub has been updated with project tracking, proposal ideas, and GCP & RFPs process. Current research underway: State of Web3 Grants, State of QF, exploring new research opportunities such as reputation systems and coordination mechanisms * EthCC planning (SP House, FTC & Gitcoiners coming together), [Passport visual touch-ups](https://docs.google.com/document/d/1rfPmfVDceQze8DNAUmCEsbk3YXoUjP8IgEZ5oU6biaU/edit#), Gitcoin Grants and PGN brand work are underway. * Gitcoin Steward is the word of the week, defined as an individual that is involved with driving the Gitcoin ecosystem forward through their work in DAO governance. Often, but not always, stewards are delegated governance tokens on behalf of GTC token holders and use them to participate in governance. Check out the [shared glossary](https://gitcoin.notion.site/Gitcoin-Glossary-287c54d3538941349b397cdf8ced4ca1) of terminology where the DAO documents common language and reinforces our shared vernacular. # 🗳️ GitcoinDAO Governance Overview: Snapshot polls GTC Stewards. Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally. ## 📊 Active Proposals: * Gating Snapshot proposals - [Go vote on Snapshot](https://snapshot.org/#/gitcoindao.eth/proposal/0xa18926b9dc9592bdf02acc3cef5a41021cebe51f73a2a3d6b007d7c38685b296) (closes Monday) * [[Discussion] Ratify the Results of Gitcoin’s Beta Round](https://gov.gitcoin.co/t/discussion-proposal-ratify-the-results-of-gitcoin-s-beta-round-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/15166) * [[Proposal] Seed Universal Impact Pools 1](https://gov.gitcoin.co/t/proposal-seed-universal-impact-pools/15398) * [[GCP-009] - Upgrading Gitcoin’s Governance Contracts](https://gov.gitcoin.co/t/gcp-009-upgrading-gitcoin-s-governance-contracts/14010) * [[Proposal] DeSci “recognized subDAO” framework](https://gov.gitcoin.co/t/proposal-desci-recognized-subdao-framework-development-and-implementation/15460) * [[Proposal] -Schelling Point Istanbul](https://gov.gitcoin.co/t/proposal-schelling-point-istanbul/15260) ## 📅 [Upcoming events](https://gitcoin.notion.site/Upcoming-Events-d749e53de96147a88a2f4864ea381afc) Gitcoin Community Call: Weekly discussions to seek community opinions on the latest DAO decisions happen every Wednesday @ 12 pm ET. Catch up on recordings of recent conversations here: * June 22: [Decentralized Design](https://twitter.com/i/spaces/1BRKjZYynAWKw) * June 14: [Citizens Round Kickoff ](https://twitter.com/i/spaces/1YpKkgQwloYKj) * June 7: [Beta Round Retro](https://twitter.com/gitcoin/status/1666475003150311424?t=L6EJzbw9qAVVKUyQJuUAFA&s=19) # 👋 New to Gitcoin? * Explore the future of Gitcoin at [our new website](https://www.gitcoin.co/), and check out [Gitcoin Community Hub](https://community.gitcoin.co/) for key resources and events. One more thing! ​The 6th edition of [Funding the Commons](https://fundingthecommons.io/) will take place on 15-16 July in Paris, France. Use the coupon code GITCOINER to get 35% off the tickets - limited spots remaining! Thanks for reading! PS: Click [here](https://share.hsforms.com/1qr4-szfGQAmHKqItMstzoAd0r2h) to subscribe to the DAO Digest",
    "timestamp": "Thu, 22 Jun 2023 19:03:07 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-11-2023/15516",
    "is_root_post": true,
    "topic_title": "Gitcoin Digest #11 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-11-2023/15516"
  },
  {
    "post_id": "10828-38",
    "author": "mmurthy",
    "content": "Just catching up on this thread. We are pushing out score breakdown in a week that explains how scores were calculated, it is non-trivial, so took some time. But I want to make the dashboard work to answer your question, so emailing you right now",
    "timestamp": "Thu, 02 Feb 2023 20:15:21 +0000",
    "url": "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q2-2022/10828/38",
    "is_root_post": false,
    "topic_title": "How should I change my delegations? [Q2 2022]",
    "topic_url": "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q2-2022/10828"
  },
  {
    "post_id": "10828-13",
    "author": "chaselb",
    "content": "Definitely agreed. For my part, I’m not sure who are actually the largest token holders of GTC and where to get that information (I believe there is a Dune dashboard somewhere…but this information is not really advertised).",
    "timestamp": "Thu, 14 Jul 2022 18:57:50 +0000",
    "url": "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q2-2022/10828/13",
    "is_root_post": false,
    "topic_title": "How should I change my delegations? [Q2 2022]",
    "topic_url": "https://gov.gitcoin.co/t/how-should-i-change-my-delegations-q2-2022/10828"
  },
  {
    "post_id": "15390-1",
    "author": "![|720x171](upload://1EexqBZKZCTX3G90D24pom4SrS8.png)",
    "content": "![|720x171](upload://1EexqBZKZCTX3G90D24pom4SrS8.png) # 🔥 Hot Topics: * @owocki provides an [overview of the QF round for greenpill.network](https://gov.gitcoin.co/t/greenpill-network-5k-qf-round-wrap-up-review/15277) he ran recently, building upon his self-published book released in Feb 2022 about how crypto could regenerate the world, and explaining how it all fits into his strategic thinking. * Get up to speed on the [S18 mid-season updates](https://gov.gitcoin.co/t/allo-grants-stack-mid-season-update/15278) shared by @meglister and @nategosselin , including: Allo + Grants Stack team split, Grants Stack S18 strategy and roadmap, and Allo v2 and S18 strategy. It’s been such an eventful month while the focus remains on achieving product-market fit and growing adoption to make democratic allocation of capital an accessible and widespread reality. * Your last opportunity to provide feedback before the results go live for the [proposal](https://gov.gitcoin.co/t/discussion-proposal-ratify-the-results-of-gitcoin-s-beta-round-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/15166) and latest discussion to Ratify the Results of Gitcoin’s Beta Round and Formally Request the Community Multisig Holders to Payout Matching Allocations, which has been updated with new perspectives and learning in public. # 🧭 Weekly Workstream Update Here are key highlights from the [weekly workstream update](https://docs.google.com/presentation/d/1WJseBI_raaBPhZFxTD-ProPvb9e9Ay-6vzWSERKmgmY/edit#slide=id.g24f27bb2388_1_10) - (video [here](https://www.youtube.com/watch?v=wjaWrkryLm8)) ### Allo + Grants Stack: * Allo brand is coming to fruition! Core brand elements have been delivered and can be found [here](https://gitcoin.notion.site/Allo-Brand-Design-Assets-1b6372032fcf434da3961bc3591261e6), including logo, color and typography. Webpage and graphics in progress. Drips marketing kicking off at the end of June. Knitting together v2 go-to-market plan. More to come next week… * The focus has shifted to supporting the development of Allo v2, while the documentation work is paused until further progress. * Endaoment Integration for QF is expected to go live on June 29th. Also, they integrated GTC as a token, enabling donor-advised funds to hold up to 50k GTC to receive and make donations. * Allo v1 enabled great opportunities for battle-testing and feedback gathering, such as running alpha and beta rounds with multiple integrators building on top, as well as the contest-style audit with our partner Sherlock. Considering the learnings from v1, v2 emerges as a revised, cleaner, more useful building experience. * Multi-round checkout problem space scoping is underway for Grant Stack product as per feedback gathered during the beta round. * UX Research and Google Analytics tagging are in progress to improve round application flow for Program Managers. Checkout enhancements (Passport integration with matching estimates, on-page checkout). * Multiple features have been shipped, including: aggregating donations by address in the Indexer, new staging environment, and other updates to support Bedrock. * Allo Improvement Proposal AIP-13 is accepted and under development to allow for a multi-round checkout with QF Calculator updates to override with percentage. * Upcoming updates in progress include: donation history page (MVP), Indexer improvements (deploy/scalability), AIP-13 contract implementation and improving Round creation form UX * Grants Stack marketing updates include: finalizing the webpage (planned to go live before 21st), security comms messaging and [Brand Book V1](https://www.figma.com/file/IYFgcVtZPebMxTuUWea4W7/Gitcoin-Grants-Stack?type=design&node-id=339-551) (embracing the interconnectedness and holonic nature of the 4 identities). [Drip campaign](https://docs.google.com/document/d/18N9a01O1iCUQ9enyt8nQubBvj4TLOJ5BejVhoMCyGfQ/edit#) starting next week! * Support Ticket Stats (June 5-11) decreased: 142 new tickets via live chat and 21 new tickets via email, revolving around passport stamps and GTC Staking. Current escalated issue: Project description missing in preview - Builder (In progress), and error in CSV downloaded from Round manager (Resolved). Use support@gitcoin.co or [intercom](https://intercom.help/gitcoin/en/) for filing issues. ### Public Goods Funding * The next Gitcoin Grants Round will be in August. A new process for community engagement is coming soon (more details to follow). * Continuing to support the first ‘Managed Services' offering for self-serve rounds with an Account Abstraction Round operated by 4337Mafia (big group chat and well connected). Fundraising has been slower than expected. June 12-26 are the estimated dates for applications and June 26th - July 9th for the Round. The matching pool goal is $200k. * View the [metrics dashboard](https://gitcoin-grants.streamlit.app/) to see contributions across rounds and projects for the Gitcoin Beta Round. * View the new round-wide data visualization tool from Supermodular [here](https://grants-graph.vercel.app/). ### Passport * Phi stamp is ready to be turned on and get a score. Upcoming updates for introducing new stamps (e.g. Holonym, Idena, Civic, Humanode) in progress. * Maintenance pages and database upgrades have been completed to help with scaling. * Planning in progress for Unique Humanity Score improvements, UX improvements, Ceramic ComposeDB Upgrade. * The focus remains on improving UX scalability for users and integrators based on load testing. New partnerships are interested in pushing the passport creation for load testing (1m-5m passports/ day). * Co-marketing process is being developed and will be ratified soon to foster ongoing collaborations with multiple orgs, including Linea/Galxe, {r}elinked, OKX. 2k new followers and 100s of thousands of impressions in the last week. * Linea campaign in progress, featuring the new zkEVM L2 created by Consensus (Metamask, Gitcoin!). Running weekly Voyage Quests (7 so far). New quest to remove bots & Sybils, Passport is one of 3 options including: Guild Pin, Galxe Passport (KYC + SBT mint). 215k total net new Passports created since the campaign started (update with current Gerald Query # minus 207k) * Passport Brand revisit in progress (the cross-functional working group has been activated to ensure alignment between mission, vision, and marketing assets. Leading up to the ‘Protect What Matters’ campaign and other initiatives to be launched). * Multiple case studies are in progress and already receiving positive feedback on a recent one using the test faucet. Discourse plugin development is in progress. * [Release Notes #8](https://gitcoin.notion.site/What-s-New-Gitcoin-Passport-4764ed4f8a3f42fdbd2d5d7dd8637872) now available. * Other Protocol updates include: Identity staking (211k max stake - up 36k staked in one day), 14 integrations (up from 7 at season start), 360k total passports created (in postgres + 153k this week due to Linea campaign), 190k total created in Ceramic (not in postgres), bringing the total all-time created unique passports up to 550k. Get up to speed on the 2 Twitter spaces this week with [Ocean Protocol](https://twitter.com/oceanprotocol/status/1668693376923738125?s=20) and [ShapeShift](https://twitter.com/ShapeShift/status/1668736021003993092?s=20). * Snapshot integration is still being migrated from SDK to API. Upcoming integrations include: {r}elinked, Thrivecoin, Linea, Collab.land, newcoin/newlife, and Metaforo. * Supermodular team is building a Passport-gated faucet starter that can be forked and run on any network. Prebuilt Passport Components under planning. * [Zakk](https://twitter.com/0xZakk) continues to drive his [sideevent.lol](https://quests.com/q/01H1PFNWE0K9E5DBMQC8HBNQ7T) experiment forward and will also publish video tutorials walking through interactive documentation as part of his quest to spread use case awareness by building applications that leverage the passport. * Work in progress for Information Architecture Review, major improvements will be reflected in new documentation structures. ### MMM * Website updates are underway. Wrapping up Grants Stack product page. Community Initiatives page and PGN sprint for next week. Side quest: [WTFisQF refresh](https://wtf-is-qf.webflow.io/). * New Canva Design System to make Twitter, blog + email banners, quote features, and branded video content. Additional cross-functional assets and workflows are underway, including merch & Illustrations design sprints, [Notion Design Hub](https://www.notion.so/Design-Hub-WIP-778cf077589842dd8ff47b84aae210e2) serves as the single source of truth for all things media (WIP) and media/Press page. * EthCC planning (SP House, FTC & Gitcoiners coming together), [Passport visual touch-ups](https://docs.google.com/document/d/1rfPmfVDceQze8DNAUmCEsbk3YXoUjP8IgEZ5oU6biaU/edit#), Gitcoin Grants and PGN brand work are underway. * Friendly reminder to use the word ‘Gitcoin’ as opposed to ‘GitcoinDAO’ when referring to our organization, in alignment with the [shared glossary](https://gitcoin.notion.site/Gitcoin-Glossary-287c54d3538941349b397cdf8ced4ca1) of terminology where the DAO documents common language and reinforces our shared vernacular. # 🗳️ GitcoinDAO Governance Overview: Snapshot polls GTC Stewards. Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally. ## 📊 Active Proposals: * Supporting Commons Conference - [Go vote on Tally (before Saturday)](https://www.tally.xyz/gov/gitcoin/proposal/61) * [[Proposal] - Schelling Point Istanbul 1](https://gov.gitcoin.co/t/proposal-schelling-point-istanbul/15260) * [[Proposal] - Gating Snapshot governance proposals](https://gov.gitcoin.co/t/proposal-gating-who-can-make-a-snapshot-governance-proposals/15050/4) * [[Discussion & Proposal] - Ratify the Results of Gitcoin’s Beta Round and Formally Request the Community Multisig Holders to Payout Matching Allocations](https://gov.gitcoin.co/t/discussion-proposal-ratify-the-results-of-gitcoin-s-beta-round-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/15166). ## 📅 [Upcoming events](https://gitcoin.notion.site/Upcoming-Events-d749e53de96147a88a2f4864ea381afc) * Gitcoin Community Call: Weekly discussions to seek community opinions on the latest DAO decisions happen every Wednesday @ 12 pm ET. Catch-up on recordings of recent conversations here: * June 14: [Citizens Round Kickoff ](https://twitter.com/i/spaces/1YpKkgQwloYKj) * June 7: [Beta Round Retro](https://twitter.com/gitcoin/status/1666475003150311424?t=L6EJzbw9qAVVKUyQJuUAFA&s=19) * May 31: [Gitcoin Citizens Round](https://twitter.com/gitcoin/status/1663938216553066499?s=20) ## 👋 New to Gitcoin? * Explore the future of Gitcoin at [our new website](https://www.gitcoin.co/), and checkout [Gitcoin Community Hub](https://community.gitcoin.co/) for key resources and events. Thanks for reading! PS: Click [here](https://share.hsforms.com/1qr4-szfGQAmHKqItMstzoAd0r2h) to subscribe to the DAO Digest",
    "timestamp": "Thu, 15 Jun 2023 11:33:46 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-10-2023/15390",
    "is_root_post": true,
    "topic_title": "Gitcoin Digest #10 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-10-2023/15390"
  },
  {
    "post_id": "15276-1",
    "author": "# 🔥 Hot Topics:",
    "content": "# 🔥 Hot Topics: * Join the ongoing conversation on the [proposal](https://gov.gitcoin.co/t/discussion-proposal-ratify-the-results-of-gitcoin-s-beta-round-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/15166) and latest discussion to Ratify the Results of Gitcoin’s Beta Round and Formally Request the Community Multisig Holders to Payout Matching Allocations, which has been updated with new perspectives and learning in public. * [Gloria ](https://gov.gitcoin.co/u/gloria/summary)shares a proposal seeking funding for running a large one-day Schelling Point event during DevConnect on November 13 in Istanbul, Turkey. This proposal is requesting a total of $275,000 from Gitcoin’s treasury to be used for production costs (more details outlined [in the post](https://gov.gitcoin.co/t/proposal-schelling-point-istanbul/15260)). * Funding Public Goods is in a race to the bottom. (yes! in case you missed [Kyle](https://gov.gitcoin.co/u/kyle/summary)’s talk at Zuzalu, the bottom in this context means: durable, continuous funding sources, as close to a value capture mechanism as possible, pluralistic and abundant, always on, by default). Watch this space! **P**retty **G**ood **N**ews coming soon... ## 🧭 Weekly Workstream Update Here are key highlights from the [weekly workstream update](https://docs.google.com/presentation/d/1WJseBI_raaBPhZFxTD-ProPvb9e9Ay-6vzWSERKmgmY/edit#slide=id.g24f27bb2388_1_10) - (video [here](https://www.youtube.com/watch?v=y51KyfvzfEs)) ### Allo + Grants Stack: * Get up to speed with our one-month in [S18 Allo Strategy](https://docs.google.com/document/d/1gL8Y3klppln37ihOksd1RJQUYzfqwtTlSQNx9GOlt5o/edit#heading=h.fdurw9uhm5r) to see how the workstream is thinking about it, and get ready for [Allo v2](https://docs.google.com/document/d/1Me5jdrkQy7dQkBYys4LZ7cTLIJCdjSHOlughBhTiLIU/edit#heading=h.tvxzmiinefwo), which kicked off this week! * Allo v1 enabled great opportunities for battle-testing and feedback gathering, such as running alpha and beta rounds with multiple integrators building on top, as well as the contest-style audit with our partner Sherlock. Considering the learnings from v1, v2 emerges as a revised, cleaner, more useful building experience. * Focus remains on proof of concept. Endaoment and Documentation site still in progress including wrapped voting. Tutorials for strategy starter kit, Priv, Decent.xyz and other integrations are on hold until the new architecture comes into place, bringing a more clear sense of what v2 will look like. * Core brand elements have been finalized. Upcoming marketing updates will be released progressively including website and graphics, book and google slides to be shared this week. Comarketing & case studies ongoing, dependent on v2 timing. * Updates on the [Strategy Doc](https://docs.google.com/document/d/1nEuAOYdUy9nMMiDvHvMa1vi4gDeTOeEW_G7yTACmnSU/edit#heading=h.fdurw9uhm5r) outlining what’s important to Grants Stack for S18 and relevant investments to be made, highlighting new goals: 13 QF rounds, 5 Direct Grants, 8 Self-Serve (which will be a cornerstone for future growth and product adoption, as opposed to QV - no longer a priority). * Relevant investments on the Grants Stack Roadmap include: easy self-serve experience, tech debt/internal scalability, and supporting 5 direct grants programs. * Ability for Program Managers to edit rounds after round creation has been shipped. Product updates in progress include: donation history page, accept rolling applications, and google analytics tagging. Upcoming engineering focus on indexer improvements, improved round application flow, and checkout enhancements (Passport integration with matching estimates, on-page checkout, multi-round checkout) * Features already shipped and ready for demo include: edit your round, donation history page (WIP), improved round application process, and passport integration in checkout with matching estimates. * Beyond the epic brand being finalized: Grants Operator Toolkit development work still underway - currently building out the Grants Tooling Landscape article and revamping the Intro to Grants Stack. * Drip campaign launch has been pushed to June 19th while messaging for security communication is being prepared. * Support Ticket Stats (May 29-June 4): 144 new tickets via live chat and 32 new tickets via email, revolving around passport stamps and guild role. Current escalated issue: project description missing in preview - Builder. Use support@gitcoin.co or [intercom](https://intercom.help/gitcoin/en/) for filing issues. ### Public Goods Funding * Continuing to reevaluate Sybil work with ODC, engineering, and the community to provide better transparency, by learning in public via the [proposal](https://gov.gitcoin.co/t/discussion-proposal-ratify-the-results-of-gitcoin-s-beta-round-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/15166) and latest discussion to Ratify the Results of Gitcoin’s Beta Round. * Running the first test of the “Managed Services” structure for self-serve rounds with an Account Abstraction Round operated by 4337Mafia (big group chat and well connected). June 12-26 are the estimated dates for applications and June 26th - July 9th for the Round. The matching pool goal is $200k. * Continuing to fundraise for Schelling Point at EthCC. Sponsorships from Radicle Drips, Celo, Golem Foundation, Privy, Salus, and possibly others! Facilitation support by FWB, Other Internet, Regens Unite, Charmverse, and others! Shouts out MMM for driving forward the logistics and programming. * Summer round will be run between July 25th - August 8th, with more details coming soon. Look out for a new approach to community engagement and a further breakdown of Core vs. Featured Rounds * View the [metrics dashboard](https://gitcoin-grants.streamlit.app/) to see contributions across rounds and projects for the Gitcoin Beta Round. * View the new round-wide data visualization tool from Supermodular [here](https://grants-graph.vercel.app/). ### Passport * Identity Staking is turned on for the next 90 days (Jun-Aug). 500+ GTC already staked. * Revamping the GTC Staking stamp thresholds (prev: 1, now: 5 GTC for bronze; and prev: 10, now: 20 GTC for silver) as an experiment to increase the number of GTC staked without decreasing the number of people who are doing it. * OKX has been added as a wallet option to further develop the relationship with the OKX team and increase exposure to the impact market, building upon the momentum gained with CyberConnect. * Passport Readme documentation has been updated. * zkSync stamp has been updated to include credentials with Era. This will hopefully reduce support questions. * New partnerships are interested in pushing the passport creation for load testing (1m-5m passports/ day). Leading to upcoming requirements for UX scalability upgrades based on load testing. * Upcoming updates for introducing new stamps (e.g. Phi, Holonym, Idena) in progress. * Planning in progress for Unique Humanity Score improvements, UX improvements, Ceramic ComposeDB Upgrade. * Passport Brand revisit in progress (cross-functional working group has been activated to ensure alignment between mission, vision, and marketing assets. Leading up to the ‘Protect What Matters’ campaign and other initiatives to be launched). * Multiple case studies in progress. Discourse plugin development in progress. * [Release Notes #7](https://gitcoin.notion.site/What-s-New-Gitcoin-Passport-4764ed4f8a3f42fdbd2d5d7dd8637872) now available. * Snapshot integration is being migrated from SDK to API. Upcoming integrations include: {r}elinked, Thrivecoin, Linea, Collab.land, and newcoin/newlife. * Score gating technical guide and stamp creation documentation have been completed. Work in progress for Information Architecture Review, major improvements will be reflected in new documentation structures. * [Zakk](https://twitter.com/0xZakk) held his first livestream on [sideevent.lol](https://quests.com/q/01H1PFNWE0K9E5DBMQC8HBNQ7T), as part of his quest to spread use case awareness by building applications that leverage the passport. * Supermodular team is building a Passport-gated faucet starter that can be forked and run on any network. Prebuilt Passport Components under planning. * Your local Data Guild builds and owns all data infrastructure for the DAO, along with all analysis, dashboards, and data studies that are requested by each workstream. * Features shipped include: cost-of-forgery first-pass, How effective was Passport in protecting Gitcoin Beta Grants Round?. Orientation datasets and materials ready to start working on an anti-collusion framework. ### MMM * Website updates underway. Grants Stack v2 page in progress, WTFisQF kicking off, testimonials live on homepage this week. * Cross-functional assets and workflows underway, including: canva template creation (sharing next week), merch & Illustrations design sprints, [Notion Design Hub](https://www.notion.so/Design-Hub-WIP-778cf077589842dd8ff47b84aae210e2) to be the single source of truth for all things media (WIP), and media/Press page. * EthCC planning (SP House, FTC & Gitcoiners coming together), [Passport visual touch-ups](https://docs.google.com/document/d/1rfPmfVDceQze8DNAUmCEsbk3YXoUjP8IgEZ5oU6biaU/edit#), Gitcoin Grants and PGN brand work underway. * Friendly reminder to use the word ‘Gitcoin’ as opposed to ‘GitcoinDAO’ when referring to our organization, in alignment with the [shared glossary](https://gitcoin.notion.site/Gitcoin-Glossary-287c54d3538941349b397cdf8ced4ca1) of terminology where the DAO documents common language and reinforces our shared vernacular. # 🗳️ GitcoinDAO Governance Overview: Snapshot polls GTC Stewards. Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally. ## 📊 Active Proposals: * [[Proposal] - Schelling Point Istanbul 1](https://gov.gitcoin.co/t/proposal-schelling-point-istanbul/15260) * [[Proposal] - State of Web3 Grants Report](https://gov.gitcoin.co/t/proposal-state-of-web3-grants-report/14562) * [[GCP-009] - Upgrading Gitcoin’s Governance Contracts](https://gov.gitcoin.co/t/gcp-009-upgrading-gitcoin-s-governance-contracts/14010) * [[Proposal] - Gating Snapshot governance proposals](https://gov.gitcoin.co/t/proposal-gating-who-can-make-a-snapshot-governance-proposals/15050/4) * [[Discussion & Proposal] - Ratify the Results of Gitcoin’s Beta Round and Formally Request the Community Multisig Holders to Payout Matching Allocations](https://gov.gitcoin.co/t/discussion-proposal-ratify-the-results-of-gitcoin-s-beta-round-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/15166). ## 📅 [Upcoming events](https://gitcoin.notion.site/Upcoming-Events-d749e53de96147a88a2f4864ea381afc) * Gitcoin Community Call: Weekly discussions to seek community opinions on the latest DAO decisions happen every Wednesday @ 12 pm ET. Catch-up on recordings of recent conversations here: * June 7: [Beta Round Retro](https://twitter.com/gitcoin/status/1666475003150311424?t=L6EJzbw9qAVVKUyQJuUAFA&s=19) * May 31: [Gitcoin Citizens Round](https://twitter.com/gitcoin/status/1663938216553066499?s=20) * May 17: [The Future of Schelling Point](https://twitter.com/i/spaces/1jMJgLvwqlbxL?s=20) ## 👋 New to Gitcoin? * Explore the future of Gitcoin at [our new website](https://www.gitcoin.co/), and checkout [Gitcoin Community Hub](https://community.gitcoin.co/) for key resources and events. Thanks for reading! PS: Click [here](https://share.hsforms.com/1qr4-szfGQAmHKqItMstzoAd0r2h) to subscribe to the DAO Digest",
    "timestamp": "Thu, 08 Jun 2023 12:21:25 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-9-2023/15276",
    "is_root_post": true,
    "topic_title": "Gitcoin Digest #9 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-9-2023/15276"
  },
  {
    "post_id": "15225-1",
    "author": "# 🔥 Hot Topics:",
    "content": "# 🔥 Hot Topics: * [Alex](https://gov.gitcoin.co/u/ale.k/summary) shares a risk mitigation initiative to foster community safeguarding. Passport Stamps are one of the first steps being taken to enable more transparency in the selection process for providers and stamps within passport.Check out [the post ](https://gov.gitcoin.co/t/risk-mitigation-at-the-dao-passport-stamps/15212)to explore a high-level framework of the risk areas under consideration. * Momus.eth, a long-time supporter of the Gitcoin climate grant round, has built a contract-based review system deployed on Arbitrum: DeReSy (Decentralized Review System). The first use case is reviewing climate round grantees’ impact and use of funds. [Read the post](https://gov.gitcoin.co/t/reviewing-gitcoin-grantee-impact-momus-eth-gitcoinreviews-co/15215) to learn more about Momus and the challenges faced in determining what Gitcoin grants to fund. * Get up-to-speed on the [proposal](https://gov.gitcoin.co/t/discussion-proposal-ratify-the-results-of-gitcoin-s-beta-round-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/15166) and latest discussion to Ratify the Results of Gitcoin’s Beta Round ## 🧭 Weekly Workstream Update Here are key highlights from the weekly workstream update - (video [here](https://www.youtube.com/watch?v=1XANysgOYH4)) ### Allo + Grants Stack: * The Allo worksteam is standing up the AIP (Allo Improvement Proposals) process for ongoing, public protocol development. Check out the [AIP repo](https://github.com/allo-protocol/aips) if you´re contributing to the community of core and ecosystem engineers [to discuss](https://github.com/orgs/allo-protocol/discussions) protocol updates and new feature requests. * Ongoing development work focused on drafting AIP for making the round contract leaner (to unblock new allocation strategies on Grant Stacks) and putting together the Allo roadmap to provide a holistic view of the projects. * Gitbook updates have been merged for project registry and AIP docs. Further documentation and tutorials in progress including strategy starter kit, documentation site, wrapped voting. Upcoming focus on Priv, Endaoment, Decent.xyz integrations next week. * Branding & UI Kit project with MMM, working on roadmap + mid-season update. Brand elements (logo, typography, palette, first round graphics) shipping this week. Ongoing development of additional assets (graphics, merch) underway. * Co-marketing & case studies planned through July. Ongoing Allo Summer drips planning in progress * A new round edit flow has been shipped, multiple bugs have been fixed on round finalization & QF algo * Checkout improvements: on-page, multi-round and passport flow are in progress. Upcoming focus on accepting rolling applications, UX copy audit, round application flow. * New processes and ways of working are coming up soon by adopting the Shape Up method. New team structure is official this week, revisiting pointing, and firming up the product support process. * Drip campaign starts next week. Grants Operator toolkit development work underway. ### Public Goods Funding * Zuzalu Round happening July 25 - August 8! Details for summer round coming soon! * A FULL CIRCLE MOMENT! [Alberto](https://twitter.com/alberto_cev/status/1663257042956451845?s=20), former Gitcoin Grantee from [Force DAO](https://twitter.com/force_dao/status/1568971135844511744?s=20) found 26 ETH in an old wallet and decided to donate it to an upcoming Gitcoin Grants round. * New passport stamp provider risk mitigation guide coming up. By sharing this broadly, the goal is to make risk a fully distributed process by collectively evolving risk mitigation and ownership. Additional plans underway for other areas of DAO-life so that everyone can put on their risk-cap to prioritize and reach consensus for what’s “risky”. * How are our partners growing as a result of Gitcoin Grants Program? What’s the impact of feature and core rounds on grantee outcomes? Why do top NGOs and Web3 groups use Allo? The answers to these questions and more, forthcoming in a case study. * View the [metrics dashboard](https://gitcoin-grants.streamlit.app/) to see contributions across rounds and projects for the Gitcoin Beta Round. * View the new round-wide data visualization tool from Supermodular [here](https://grants-graph.vercel.app/). ### Passport * Focus remains on improving features and building new onchain stamps (EAS) - (MVP on Sepolia, working Arbitrum). * Upcoming updates for introducing new stamps (e.g. Hypercerts,ZKSync Era, Phi, Holonym, Idena) in progress. * The new stamp meta-data endpoint is completed, enabling integrators to display user stamps within their own dApps by pulling dashboard data (icons, text, credentials) and decoupling from our UI to make it more accessible. * Planning in progress for Unique Humanity Score improvements, UX improvements, Ceramic ComposeDB Upgrade. * Civic stamp proposal is completed, score gating technical guide in progress, prebuilt Passport Components * [Zakk](https://twitter.com/0xZakk) is on a quest to spread use case awareness by experimenting with live streaming while building applications that leverage the passport. The live stream starts on June 5, follow along on [sideevent.lol](https://quests.com/q/01H1PFNWE0K9E5DBMQC8HBNQ7T) to see the first fun application for events. * Integrations with Thrivecoin, Linea, and Collab.land underway. * Passport Brand revisit in progress (cross-functional working group has been activated to make sure we’re very happy with mission, vision, etc, so we can confidently launch large marketing campaigns) * Beginning to flesh out a Protect What Matters campaign brief—our likely overarching campaign for the next two months * Released [Release Notes #6](https://gitcoin.notion.site/What-s-New-Gitcoin-Passport-4764ed4f8a3f42fdbd2d5d7dd8637872) * Your local Data Guild builds and owns all data infrastructure for the DAO, along with all analysis, dashboards, and data studies that are requested by each workstream. * Features shipped include Rule-based sybil defense prototype, score bands for passport risk tolerance, How did Donor Behaviors in the Beta Round compare to Previous Rounds?. Working on QF Counterfactuals (´what if´ questions - inspired by Vitalik) ### MMM * Website updates underway. 2-week sprint to develop Allo page, revised homepage, updated nav. Next 2-week sprint to develop program page, Grants Stack v2 page, WTFisQF site (bounty kicking off), brief, posting, selection, build, deliver * [Notion ](https://www.notion.so/Design-Hub-WIP-778cf077589842dd8ff47b84aae210e2)1-pagers media/press and Design Hub are underway. Outstanding: Grants Stack, Allo, Canva template creation almost done. * Merch & Illustrations design sprints. EthCC planning & visuals in progress. Gitcoin Grants Brand Strategy & Visuals (yes, already) * As part of efforts to reposition Gitcoin as a tech-first organization, the Gitcoin Thought Leadership Program will help existing and emerging thought leaders share their expertise to build eminence. For details on participation, see the [Notion page here](https://www.notion.so/gitcoin/GTC008-S18-19-Thought-Leadership-Program-d52bcc3c8dea45b4a73280f52a228f97). ## 🗳️ GitcoinDAO Governance Overview: Snapshot polls GTC Stewards. Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally. ### 📊 Active Proposals: * [[Discussion & Proposal] - Ratify the Results of Gitcoin’s Beta Round and Formally Request the Community Multisig Holders to Payout Matching Allocations](https://gov.gitcoin.co/t/discussion-proposal-ratify-the-results-of-gitcoin-s-beta-round-and-formally-request-the-community-multisig-holders-to-payout-matching-allocations/15166). * [[Proposal] - Amendments to the Steward Council.](https://gov.gitcoin.co/t/proposal-amendments-to-the-steward-council/15118) * [[GCP-009] - Upgrading Gitcoin Governance Contracts](https://gov.gitcoin.co/t/gcp-00x-upgrading-gitcoin-s-governance-contracts/14010) * [[Proposal] - Gating Snapshot governance proposals](https://gov.gitcoin.co/t/proposal-gating-who-can-make-a-snapshot-governance-proposals/15050) ### 📅 [Upcoming events](https://gitcoin.notion.site/Upcoming-Events-d749e53de96147a88a2f4864ea381afc) * Gitcoin Community Call: Weekly discussions to seek community opinions on the latest DAO decisions happen every Wednesday @ 12 pm ET. Catch-up on recordings of recent conversations here: * **May 31:** [Gitcoin Citizens Round](https://twitter.com/gitcoin/status/1663938216553066499?s=20) * **May 17**: [The Future of Schelling Point](https://twitter.com/i/spaces/1jMJgLvwqlbxL?s=20) * **May 10:** [Beta Round Recap ](https://twitter.com/i/spaces/1jMJgLvVWEexL) 👋 New to Gitcoin? * Explore the future of Gitcoin at [our new website](https://www.gitcoin.co/), and checkout [Gitcoin Community Hub](https://community.gitcoin.co/) for key resources and events. Thanks for reading! PS: Click [here](https://share.hsforms.com/1qr4-szfGQAmHKqItMstzoAd0r2h) to subscribe to the DAO Digest",
    "timestamp": "Thu, 08 Jun 2023 12:09:55 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-8-2023/15225",
    "is_root_post": true,
    "topic_title": "Gitcoin Digest #8 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-8-2023/15225"
  },
  {
    "post_id": "15152-7",
    "author": "rohit",
    "content": "Hello - thanks for highlight this. Some of these documents are interim work-in-progress drafts and don’t reflect the final decisions. For related topics / ongoing discussion, please find the latest and greatest at the following links. Also, DAO contributors will soon share detailed analyses, statistics, and takeaways from the Beta Round in the governance forum in the coming weeks.",
    "timestamp": "Tue, 30 May 2023 14:13:48 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152/7",
    "is_root_post": false,
    "topic_title": "Gitcoin Digest #7 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152"
  },
  {
    "post_id": "15152-6",
    "author": "CoachJonathan",
    "content": "Did this get resolved? Just checked any anyone should be able to see the WS update slides.",
    "timestamp": "Tue, 30 May 2023 09:54:23 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152/6",
    "is_root_post": false,
    "topic_title": "Gitcoin Digest #7 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152"
  },
  {
    "post_id": "15152-5",
    "author": "gaoa97",
    "content": "[quote=“gaoa97, post:1, topic:15152”] View the metrics dashboard to see contributions across rounds and projects for the Gitcoin Beta Round. [/quote] @Supreme have you tried reloading the page? it’s working fine from my end.",
    "timestamp": "Fri, 26 May 2023 23:23:41 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152/5",
    "is_root_post": false,
    "topic_title": "Gitcoin Digest #7 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152"
  },
  {
    "post_id": "15152-4",
    "author": "gaoa97",
    "content": "Thanks for your feedback (and @bobjiang )! The links were taken from the Weekly Workstream Update Deck (I have the same access restrictions from your comment - assuming that access is only granted to call participants?) Maybe @MathildaDV @rohit could advise /grant access?",
    "timestamp": "Fri, 26 May 2023 23:14:03 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152/4",
    "is_root_post": false,
    "topic_title": "Gitcoin Digest #7 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152"
  },
  {
    "post_id": "15152-3",
    "author": "bobjiang",
    "content": "I have all the errors like you. gaoa97: View the new round-wide data visualization tool from Supermodular here . one comment for this tool, and it is for the round manager (and everyone could use it as well), before using this tool, you have to know the round address (which is a smart contract address for the specific round). For example here is the address for GCC featured round - 0x859faeaa266ba13bd1e72eb6dd7a223902d1adfe",
    "timestamp": "Fri, 26 May 2023 03:06:56 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152/3",
    "is_root_post": false,
    "topic_title": "Gitcoin Digest #7 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152"
  },
  {
    "post_id": "15152-1",
    "author": "Supreme",
    "content": "Hi, thanks for this wonderful update! I would love to see the information from the links that you have posted. These links have no view access: gaoa97: First iteration results here for calc-checks. gaoa97: Sybil outcomes here (with rule-trigger documented!). gaoa97: View the metrics dashboard to see contributions across rounds and projects for the Gitcoin Beta Round. [/quote] There isn’t any info here. 3.This link is blank gaoa97: View the new round-wide data visualization tool from Supermodular here . No Access Check out the brief to dive deeper. No access https://gitcoin-grants.streamlit.app Scoring mechanism is iterative (read more here !), Read full topic https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152/2 Thu, 25 May 2023 19:47:07 +0000 gov.gitcoin.co-post-15152-2 Gitcoin Digest #7 2023 Gitcoin Digest #7 2023 gaoa97 Hot Topic: Shawn16400 proposes three Amendments to the Steward Council building upon Proposal: V2 of the Steward Council , namely: removing the specificity of the team composition, changing meeting type and frequency, and adjustments to the election process. Weekly Workstream Update Here are key highlights from the weekly workstream update - (video here ) Allo + Grants Stack: The current teams have been divided into two. The Allo team will focus on building Allo Protocol for developers requiring resource allocation tools. The Grants Stacks team will focus on building Grants Stack for program managers who require resource allocation, as a user-friendly tool for operating grant programs. The user-centric product focus will enable the development of specialized skill sets and different work styles. Prioritizing problem-solving over implementing features, building for self-serve audiences, balancing proactive vs reactive prioritization. Check out the brief to dive deeper. Documentation and tutorials for voting and payout strategy have been updated. Documentation for project registry integration, API and starter kit are lined up next to facilitate development on the protocol. Next focus will be on wrapping up solar/lunar punk requirements. Q2 priorities for DevRel can be reviewed here Brand elements (logo, typography, palette, first round graphics) shipping this week, with ongoing development of additional assets (graphics, merch, summer drips) underway. New Allo v1 “drip” launch kickoff date is May 29. Comarketing &amp; case studies planned through July Draft marketing roadmap complete - waiting for review and launch date updates. Visuals have been shared, shipping brand next week. Grants Operator Toolkit development work underway. Public Goods Funding Applications for the Citizens Round are OPEN NOW until June 4th! This round will be on Optimism, with a 20K DAI matching pool. Continuing to work through quality assurance issues: [big ones: saturation, minimum donation threshold, QF calc order-of-operations] Focus on fraud detection and squelching, including cursory analysis for partners’ rounds; some featured rounds already finalized and paid out. First iteration results here for calc-checks. Sybil outcomes here (with rule-trigger documented!). Partners are not showing huge concern for manipulation, and evidence of self-attack is minimal (highly obvious with the help of Umar’s dash!). Reviewing the process for community-reported attacks so that these can be consolidated and fully transparent. Sybil prevalence estimates are now something we will report round-by-round for core rounds. View the metrics dashboard to see contributions across rounds and projects for the Gitcoin Beta Round. View the new round-wide data visualization tool from Supermodular here . Survey went out to grantees with 52 responses as of May 23 (~13%). Further grantee optional survey data to be completed between rounds. Grantee experience learnings forthcoming! Passport Focus on bug fixes based on Beta Round feedback, along with onchain stamps (EAS) - (MVP on Sepolia, working Arbitrum). Roadmap updates for introduction of new stamps (e.g. Hypercerts,ZKSync Era, Phi, Holonym, Idena) in progress. Upcoming focus on new stamp meta-data endpoint, Unique Humanity Score improvements, UX improvements, Ceramic ComposeDB Upgrade. Migration completed for Bankless Academy (SDK, API live), including an in-depth technical guide for score integration. Score gating technical guide and prebuilt Passport components in progress. Passport Brand revisit in progress (cross-functional working group has been activated to make sure we’re very happy with mission, vision, etc, so we can confidently launch large marketing campaigns). Documents to support the business development team in progress. Released Release Notes #5 . New protocol for social with Cyberconnect; 100k passports were anticipated based on active users and ~180k created in total. 7.7k new Passports with passing score over the weekend. Scoring mechanism is iterative (read more here !), average score hovering close to minimum thresholds (15-26), score bands for integrator risk tolerance forthcoming. MMM Website updates underway. 2-week sprint to develop Allo page, revised homepage, updated nav. Next 2-week sprint (starting May 29) to develop program page, Grants Stack v2 page, WTFisQF site (TBC). Full schedule here. As part of efforts to reposition Gitcoin as a tech-first organization, the Gitcoin Thought Leadership Program will help existing and emerging thought leaders share their expertise to build eminence. For details on participation, see the Notion page here . In progress: Grants Stack visual identity, Canva template, Impact Report and Research , DAO-wide visual audit, PGN visual identity, EthCC planning and visuals. GitcoinDAO Governance Overview: Snapshot polls GTC Stewards. Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally. Active Proposals: [Proposal] - Amendments to the Steward Council [GCP-009] - Upgrading Gitcoin Governance Contracts [Proposal] - State of Web3 Grants Report [Proposal] - Gating who can make a Snapshot governance proposals Upcoming events Gitcoin Community Call: Weekly discussions to seek community opinions on the latest DAO decisions happen every Wednesday @ 12 pm ET. Catch-up on recordings of recent conversations here: May 17: The Future of Schelling Point May 10: Beta Round Recap May 3: Beta Round Half Time Show New to Gitcoin? Explore the future of Gitcoin at our new website , and checkout Gitcoin Community Hub for key resources and events. Thanks for reading! PS: Click here to subscribe to the DAO Digest",
    "timestamp": "Thu, 25 May 2023 16:13:44 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152/1",
    "is_root_post": true,
    "topic_title": "Gitcoin Digest #7 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-7-2023/15152"
  },
  {
    "post_id": "15097-4",
    "author": "MathildaDV",
    "content": "Thank you @gaoa97 ! This is great",
    "timestamp": "Thu, 25 May 2023 00:22:35 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-6-2023/15097/4",
    "is_root_post": false,
    "topic_title": "Gitcoin Digest #6 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-6-2023/15097"
  },
  {
    "post_id": "15097-3",
    "author": "ZER8",
    "content": "Tis is the first digest that doesn’t contain the FDD(because it dissolved) and that makes me sad , but besides that it’s a great resource for stewards and interested individuals to learn about all the stuff that’s going on in the DAO…and there’s a lot of it. Great work!",
    "timestamp": "Wed, 24 May 2023 21:12:02 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-6-2023/15097/3",
    "is_root_post": false,
    "topic_title": "Gitcoin Digest #6 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-6-2023/15097"
  },
  {
    "post_id": "15097-2",
    "author": "CoachJonathan",
    "content": "Great write up @gaoa97 ! Thanks for your contribution here!",
    "timestamp": "Fri, 19 May 2023 12:19:27 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-6-2023/15097/2",
    "is_root_post": false,
    "topic_title": "Gitcoin Digest #6 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-6-2023/15097"
  },
  {
    "post_id": "14976-1",
    "author": "## 🔥 **Hot Topics:**",
    "content": "## 🔥 **Hot Topics:** * As part of the iterative process to improve governance communications, [Shawn](https://gov.gitcoin.co/u/shawn16400/summary) shares the plan for weekly summaries and monthly governance report in the post for [Governance update: May 2023](https://gov.gitcoin.co/t/governance-update-may-2023/14826) * Catch all the details in the post by [Kris](https://gov.gitcoin.co/u/krrisis/summary) for [Gitcoin Grants Citizens Rounds](https://gov.gitcoin.co/t/rewarding-the-community-gitcoin-citizen-round-1/14905) to reward people and grassroots projects that have contributed to Gitcoin’s success. With ‌Matching Pool funding of 13.3K GTC (20K DAI), ‌applications for the Citizen Round will officially open on Monday May 15. * In the post [Gitcoin: who makes the decisions anyway?](https://gov.gitcoin.co/t/gitcoin-who-makes-the-decisions-anyway/14537), [Shawn](https://gov.gitcoin.co/u/shawn16400/summary) seeks input on identifying hot spots in the use of Approval Matrix and DACI models that define the lifecycle of how the decision gets from identification to approval. * [David](https://gov.gitcoin.co/u/davidacasey/summary) shares the proposal for Gitcoin to [Support the Funding the Commons Hackathon, Residency and Conference Series](https://gov.gitcoin.co/t/proposal-support-the-funding-the-commons-hackathon-residency-and-conference-series/14904). The event series would directly utilize Gitcoin’s Grants Stack in a variety of ways, including to deploy funding to projects by running a Funding the Commons grant round. * [Eugene](https://gov.gitcoin.co/u/eleventh19/summary) outlines the proposal to produce a report on the [current state of web3 grants](https://gov.gitcoin.co/t/proposal-state-of-web3-grants-report/14562). Besides being a market analysis work for Grants Stack, the insights from the report would serve as a public good for entire ecosystem to learn and benefit from. ## **🧭** **Weekly Workstream Update** Here are key highlights from the [weekly workstream update](https://docs.google.com/presentation/d/1WJseBI_raaBPhZFxTD-ProPvb9e9Ay-6vzWSERKmgmY/edit?usp=sharing) (video [here](https://www.youtube.com/watch?v=J0ckCHlK6Z8)): **Allo + Grants Stack:** * Current focus ([roadmap here](https://miro.com/app/board/uXjVPsTabFA=/?share_link_id=770500701816)): Improvements and fixes for Beta feedback; Solarpunk - Round edit flow; Lunarpunk - Post round-UI for Linear QF * Upcoming efforts will include enhancing the QF experience, quadratic voting, and utilizing the [Productboard](https://www.productboard.com/) tool for roadmaps to bring more visibility to the backlog * REMINDER! Support has moved over to Intercom (widget available in the bottom right-hand corner in the apps). Users should report product-related bugs, suggestions, and questions in Intercom. * [Template for Allo Improvement Process](https://github.com/allo-protocol/aips/pull/7) is now available to utilize community feedback for Allo * Documentation and tutorials in progress for voting and payout strategy with documentation for project registry integration lined up next * Upcoming Allo [integrations](https://gitcoin.notion.site/Allo-Integrations-115d3f4aebbe432fa616221c1716b0ff) include Privy Sweepstakes (expected May 22), Endaoment (confirmed, dev started), Decent (dev starts soon) * Q2 priorities for DevRel can be reviewed [here](https://gitcoin.notion.site/Q2-2023-Dev-Ecosystem-Priorities-151d258304fb4173bee5a095d59b6947) * [Allo Brand Moodboards](https://drive.google.com/file/d/1k4xnL8GUtLUl0q8ycjLcXlbHqwOTtGDz/view?pli=1) reviewed and approved; focus on logo concepts and typography selection * Grants Stack Self Serve marketing plan and moodboards are in progress **Public Goods Funding** * View the [metrics dashboard](https://gitcoin-grants.streamlit.app/) to see contributions across rounds and projects for Gitcoin Beta Round. Approximately, a total of 107K contributions have raised $600k in funding. Most rounds witnessed a 1.5x to 3x jump in contributions just in the last week of the round. * 117K instances of the [Stand with Crypto](https://twitter.com/coinbase/status/1650612986980048897?s=20) NFT minted * Post round focus on conducting Sybil analysis and fraud detection before the final calculations **Passport** * New stamp available for [guild.xyz](https://guild.xyz/); focus on bug fixes and copy updates based on Beta Round feedback, along with onchain stamps (EAS) * Roadmap updates for introduction of new stamps (e.g. Hypercert, Civic, Holonym) in progress * Upcoming focus on data dashboard, Unique Humanity Score improvements, UX improvements, Ceramic ComposeDB Upgrade * [Market Lanscape Analysis](https://gitcoin.notion.site/Gitcoin-Passport-Market-Landscape-Analysis-May-2023-e1dcab1d89004fbc8077bebecf7acf27) presented to Passport Pod; review weekly release notes [here](https://gitcoin.notion.site/What-s-New-Gitcoin-Passport-4764ed4f8a3f42fdbd2d5d7dd8637872) * Sample library completed; winner identified for [‌bounty](https://daoglobalhackathon.com/bounties) at DAO Global Hackathon hosted by Aragon * Integration in progress with Snapshot for migrating to API; technical guide for Score integration **MMM** * As part of efforts to reposition Gitcoin as a tech-first organization, the [Gitcoin Thought Leadership Program](https://docs.google.com/presentation/d/17bt-jnXc1jEdWGJdBl97XksZtiMx4LF5AvzP0CVsimA/edit?usp=sharing) will help existing and emerging thought leaders share their expertise to build eminence * Pages in progress: Allo page, Program page, Grants Stack v2 page, revised home page, and a refresh for WTFisQF, search and topic sections for Blog, media center ([full schedule](https://sharing.clickup.com/42083557/l/h/6-900900854532-1/0a09648fad87ae5)) * In progress: Grants Stack visual identity, Canva template, [Impact Report and Research](https://gov.gitcoin.co/t/proposal-state-of-web3-grants-report/14562), DAO-wide visual audit, Metalabel round 2 * Roles open for [publicist](https://docs.google.com/document/d/1qRL2ccPQrs5trjPf-nhG-fAgK-cPfZM-CrF1rA75k3c/edit) and [designers](https://wellfound.com/company/gitcoin/jobs) * Ratification upcoming shortly for DAO [Mission, Vision, Brand values](https://gov.gitcoin.co/t/discussion-poll-aligning-on-gitcoins-mission-vision/13639) ## 🗳️ **GitcoinDAO Governance Overview:** *Snapshot polls GTC Stewards. Tally performs on-chain actions. Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally.* ## **Active Proposals:** * [[GCP-010] Evolving Gitcoin Grants: The Q.E.D. Program](https://gov.gitcoin.co/t/gcp-evolving-gitcoin-grants-the-q-e-d-quadratic-experimentation-and-development-program/14174) - [Go vote](https://snapshot.org/#/gitcoindao.eth/proposal/0x8b8e0ed4ec6ef5031b407d4abbc41a604c2f14528a12ec87e21aa5f9e04cabc7), ends May 15, 2023 * [[GCP-009] - Upgrading Gitcoin Governance Contracts](https://gov.gitcoin.co/t/gcp-00x-upgrading-gitcoin-s-governance-contracts/14010) * [[Proposal] - Support the Funding the Commons Hackathon, Residency and Conference Series](https://gov.gitcoin.co/t/proposal-support-the-funding-the-commons-hackathon-residency-and-conference-series/14904) * [[Proposal] - State of Web3 Grants Report](https://gov.gitcoin.co/t/proposal-state-of-web3-grants-report/14562) **📅** [**Upcoming events**](https://gitcoin.notion.site/Upcoming-Events-d749e53de96147a88a2f4864ea381afc) You can find information about the Gitcoin-organized and Community-organized events on the [Upcoming Events](https://gitcoin.notion.site/Upcoming-Events-d749e53de96147a88a2f4864ea381afc) page. **Gitcoin Community Call:** Weekly discussions to seek community opinions on the latest DAO decisions happen every Wednesday @ 12 pm ET. Catch-up on recordings of recent conversations here: * **May 10:** [Beta Round Recap](https://twitter.com/i/spaces/1jMJgLvVWEexL) * **May 3:** [Beta Round Half Time Show](https://twitter.com/gitcoin/status/1653791672487100419?s=20) * **April 26:** [Deep Dive into FDD](https://twitter.com/gitcoin/status/1651254815371014144?s=20) **👋** **New to Gitcoin?** * Explore the future of Gitcoin at [our new website](https://www.gitcoin.co/), a hub for all things related to public goods funding Thanks for reading!",
    "timestamp": "Tue, 16 May 2023 10:29:34 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-digest-5-2023/14976",
    "is_root_post": true,
    "topic_title": "Gitcoin Digest #5 2023",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-digest-5-2023/14976"
  },
  {
    "post_id": "14957-2",
    "author": "shawn16400",
    "content": "Hey @TomasM Thanks for the follow up and thanks for extending the 15% discount. Recall that when Gitcoin met with Messari back on Feb 8th (Jack, Jacob, and Ryan) we requested that in exchange for providing governance feedback for your proprietary tool, Messari would make public goods data / analysis free of change. I was not looking for a commitment from the team at the time, but I was assured that we gave some really good feedback which I can see has been worked into the end product. This being the case, we would love to work with Messari to bring your collective intelligence on public goods, to public goods, as a public good. hmu on discord at shawn16400#5507",
    "timestamp": "Thu, 11 May 2023 13:02:04 +0000",
    "url": "https://gov.gitcoin.co/t/messari-governance-alerts-for-gitcoin/14957/2",
    "is_root_post": false,
    "topic_title": "Messari Governance Alerts for Gitcoin",
    "topic_url": "https://gov.gitcoin.co/t/messari-governance-alerts-for-gitcoin/14957"
  },
  {
    "post_id": "14957-1",
    "author": "TomasM",
    "content": "Hello, My name is Tomas , and I lead the governance research at Messari. We’re happy to announce that we just launched our governance alerts for both off and on chain votes AND forum discussions available for 100+ DAOs! In addition to the free coverage of proposals (for all users), our Pro &amp; Enterprise users can now set up real-time Daily, or Weekly digests for the DAOs they want to track and see the Gov Alert emails (see the example below). Where can you use it? Click the “Notify Me” button on any DAO Profile page . Add or edit bulk alerts on the new Governor Alerts management area under a user’s profile here . We’ve set up a special 15% pro-tier discount code exclusively for the community, making it more accessible for you to try out our services: GITCOIN. Hope you find this useful, please enjoy it and feel free to share it with your community!",
    "timestamp": "Thu, 11 May 2023 09:47:19 +0000",
    "url": "https://gov.gitcoin.co/t/messari-governance-alerts-for-gitcoin/14957/1",
    "is_root_post": true,
    "topic_title": "Messari Governance Alerts for Gitcoin",
    "topic_url": "https://gov.gitcoin.co/t/messari-governance-alerts-for-gitcoin/14957"
  },
  {
    "post_id": "14841-1",
    "author": "Familiar as a sound proof recently recorded, more opportunities to build projects and adaptability for links with us for contribution assistance. An avenue to create space, this is a good feat for me @free2ride19",
    "content": "Familiar as a sound proof recently recorded, more opportunities to build projects and adaptability for links with us for contribution assistance. An avenue to create space, this is a good feat for me @free2ride19 free2ride19: https://twitter.com/react_energy/status/1610726825059041280?s=46&t=KA1zO5uHNiJgHqYiAXjM8Q free2ride19: https://go.gitcoin.co/blog/hypercerts-for-public-goods-funding free2ride19: https://builder.gitcoin.co/ free2ride19: https://store.gitcoin.co free2ride19: https://link.gitcoin.co/communityhub free2ride19: https://gov.gitcoin.co/search?q=gitcoindao%20digest%20order%3Alatest free2ride19: https://gov.gitcoin.co free2ride19: https://twitter.com/Gitcoin free2ride19: https://grants.gitcoin.co/free2ride19: https://gov.gitcoin.co/c/governance-proposals/5 free2ride19: https://explorer.gitcoin.co/",
    "timestamp": "Mon, 08 May 2023 22:58:43 +0000",
    "url": "https://gov.gitcoin.co/t/gitcoin-dao-digest/14841",
    "is_root_post": true,
    "topic_title": "Gitcoin Dao Digest",
    "topic_url": "https://gov.gitcoin.co/t/gitcoin-dao-digest/14841"
  }
]